[
  {
    "body": "\n        \n\n        Man rushed to hospital after shooting in Brampton neighbourhood",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/5/0f/50ffd542-aeb3-56b9-b2e7-632493f8e07a/672fd0a32b972.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/man-rushed-to-hospital-after-shooting-in-brampton-neighbourhood/article_4882fec9-a3e3-55fd-92e3-799114afaab1.html",
    "description": "A man is in serious condition after a shooting in Brampton Saturday afternoon. Peel paramedics were called to the residential area of Inder Heights Drive and Mayfield Road around 1:30 p.m. where they found a 29-year-old with multiple gunshot wounds. The man was then rushed to hospital. The shooter fled the scene and Peel police do not have suspect information at this time.  There is a large police presence in the area as they investigate.  This is a developing story.  SHOOTING:\n\n-Inder Heights Dr/Mayfield Rd #Brampton\n-Adult ml shot, taken to hospital in serious condition.\n-Suspect(s) no longer in the area.\n-Large police presence.\n-Avoid the area.\n-More info as we have it.\n-PR240359014 \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Kristjan Lautens is an editorial student trainee, working out of\nthe Star’s radio room in Toronto. Reach her via email: klautens@thestar.ca To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ready for some winter fun in Vaughan? WinterFest returns to Canada’s Wonderland",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/d/02/d024c0a9-5394-5986-ad2d-5dc428f35907/672df81643eb2.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/ready-for-some-winter-fun-in-vaughan-winterfest-returns-to-canada-s-wonderland/article_9ff5ba9a-64ec-5c59-9fae-7f94de2ac059.html",
    "description": "The holiday magic of WinterFest returns to Canada’s Wonderland for its fifth season on Nov. 16. The annual holiday event — featuring live shows, enchanted themed areas, millions of lights, and festive food — is open on select dates until Jan. 4, 2025. “Get ready for the biggest, brightest holiday experience around,” said Phil Liggett, general manager in a news release. “WinterFest is a feel-good event for guests of all ages and brings the magic of the season to life. If you haven’t had a chance to see it, this is Canada’s Wonderland like you’ve never seen it before.” This year’s festivities include a nightly tree lighting ceremony, nine live shows, musical performances and interactive attractions like ice skating on Snow Flake Lake, photo ops with Elf on a Shelf and cookie decorating with Mrs. Claus.  Wonderland’s WinterFest returns with more than 40 attractions, including:  Tinker’s Toy Factory: An indoor show at Canterbury Theatre with music, acrobatics and an entertaining story about elf hijinks in Santa’s Workshop.  Rides: Guests can enjoy more than 20 rides, including the children’s rides in Charlie Brown’s Christmas Town, and other favourites like Thunder Run, Klockwerks, Psyclone and Sledge Hammer. Ice Skating on Snow Flake Lake: Attendees can glide down the ice on the shimmering, frozen lake in front of Wonder Mountain and surrounded by lit trees and holiday light projections. Advance online reservations are required. Nightly tree-lighting ceremony: A song-and-dance event on International Street where two 50-foot-tall Christmas trees are lit, and decorated with thousands of lights and ornaments.  Cool Yule Christmas: A high-energy, fun-filled show covering Christmas pop songs. Jack Frost’s Igloo Village: Guests can rent a cosy, private igloo for the evening with concierge food and beverage service. Four Drummers Drumming: Playful toy soldiers drum familiar favourites with the crowd. A PEANUTS™ Guide to Christmas: Guests can join Charlie Brown and the gang in an enjoyable singalong to celebrate the holidays. Elf on the Shelf: Santa’s favourite helper will keep an eye on guests and is happy to pose for photos. Christmas Market: A Christmas market featuring local artisan vendors, food and amazing gift ideas.  Find a full list of shows and attractions, operating hours, tickets and reservations for WinterFest 2024 here. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Veracia Ankrah is a reporter with YorkRegion.com. Reach her at\nvankrah@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘Honour the incredible sacrifices’: Brampton hosts Remembrance Day ceremonies",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/5/4f/54f9b46a-555a-5e5e-977a-d28909ce3d19/672e4b761b1e2.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/honour-the-incredible-sacrifices-brampton-hosts-remembrance-day-ceremonies/article_3aeedadb-9f3d-5e9b-ad78-35e7be159a6a.html",
    "description": "The City of Brampton is hosting Remembrance Day ceremonies on Monday, Nov. 11 in collaboration with Royal Canadian Legion Branch 15 and 609. To pay tribute to the more than 2.3 million Canadians who have served Canada, including the 118,000 who made the ultimate sacrifice, a sunrise service will take place at 7:55 a.m., at the Meadowvale Cemetery Chapel, 7732 Mavis Rd.,  At 10:30 a.m., a parade and service will be held at Ken Whillans Square Cenotaph, 2 Wellington St. W. As part of the city’s tribute, banners featuring Brampton veterans are displayed outside Brampton City Hall near Ken Whillans Square. Brampton Mayor Patrick Brown said Remembrance Day is a time to “come together as a community and honour the incredible sacrifices” made by veterans and those who continue to serve. “Brampton is proud to stand with them, ensuring their legacy of courage, commitment and service is never forgotten,” he said in a statement. “On behalf of the City of Brampton, I encourage everyone to join us in paying tribute to our veterans, not only on Nov. 11, but every day.” Brampton has been hosting Remembrance Day ceremonies since 1920. City hall, all city facilities, all Brampton Library branches and the Brampton Animal Shelter will be closed Monday while all essential services, traffic services, bylaw enforcement, road operations and security services will continue to operate as usual, according to the city.  Visit the city’s Remembrance Day webpage for more information on Remembrance Day events and initiatives. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Got mail? Here are other mail and shipping options for Canadians as potential Canada Post strike looms",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/a/9b/a9bcdeb8-f78e-5283-b54a-6ee15cef53bf/672e8033de44b.image.jpg?resize=200%2C130",
    "url": "https://www.bramptonguardian.com/news/got-mail-here-are-other-mail-and-shipping-options-for-canadians-as-potential-canada-post/article_95495974-040b-5302-b7d1-5887cde9176c.html",
    "description": "As the threat of a possible work stoppage at Canada Post looms ahead of the holidays, you may be wondering what other shipping services are available to you. There are numerous options actually. Canada Post and the union representing its postal workers are negotiating a new collective agreement. While neither side has issued a notice of strike or lockout, both parties are in a legal position to do so. They must provide a minimum of 72 hours’ notice before a labour disruption can occur. Canada Post has said the threat of this labour disruption has already impacted its business, as volumes and revenue are down ahead of what’s usually a busy holiday shipping season. So, if you are feeling nervous about using Canada’s postal service, even as it continues to deliver the mail, below are some options available to you for shipping within Canada and internationally. U.S.-based global shipping company FedEx offers Canada-wide and international shipping services. It consists of express delivery and includes next-day delivery to most metropolitan areas, to standard ground and freight services. If you need to send items to the United States or other international markets, FedEx has standard shipping and express options, including next-day shipping to many locations within the U.S. More information is available at fedex.com. While Canada Post is the majority owner of Purolator, the workers at this Canadian courier company are represented by a different union than those at Canada Post. So any strike action at Canada Post will not impact Purolator’s services. The shipping company can deliver packages to, from and within Canada and to more than 210 countries. With more than 2,500 authorized shipping agents in Canada, finding a location is as easy as finding a local pharmacy. More information is available at purolator.com. Another U.S.-based company, UPS provides global shipping and logistics services. Canadians can use it for domestic and international shipping, including same-day delivery options as well as freight shipping options. The company also offers Saturday delivery in Canada. More information is available at ups.com. What launched as a local delivery business in the Toronto area in the 1980s has grown to become a courier transportation and logistics company serving all of Canada as well as in the U.S., with a focus on serving health-care, IT and retail businesses. More information is available at appleexpress.com. The DHL international courier service provider, which is owned by Germany’s Deutsche Post, provides services for international shipping from Canada. DHL has document and parcel services for all shippers, as well as retailer and volume shipping and cargo shipping for businesses. More information is available at dhl.com. ShippingChimp provides shipping services anywhere in Canada and the U.S., as well as to destinations in other parts of the world, with a focus on eCommerce shipping solutions for small businesses. More information is available at shippingchimp.com. DTDC Express Canada, which is part of India’s largest parcel delivery network, is a courier specializing in cross-border eCommerce services. It has a direct presence in 21 countries, including the U.S. and U.K., and with operations, through associates, in many other countries. More information is available at canada.dtdc.com. Quebec-based last-kilometre logistics company Intelcom, which operates as Dragonfly outside Quebec, utilizes independent delivery partners to handle up to 600,000 daily deliveries in 10 provinces and two territories. The company has numerous stations in Ontario. More information is available at intelcom.ca. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ontario, Canada recalls: Space heaters sold on Amazon, Wolf griddle, lip balm, Johnsonville sausages, bread sold at Sobeys, FreshCo, Foodland, Metro, Shoppers Drug Mart and more",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/7/55/755f54ee-b277-5b78-9c01-a5143ebaaf49/672e75de3d342.image.png?resize=200%2C177",
    "url": "https://www.bramptonguardian.com/news/ontario-canada-recalls-space-heaters-sold-on-amazon-wolf-griddle-lip-balm-johnsonville-sausages-bread/article_db07fc28-0ac4-520e-bd40-fd2c1eaa3b34.html",
    "description": "Thousands of space heaters sold on Amazon, battery packs, various bread and buns sold at major Ontario grocery stores, Wolf griddle, Johnsonville sausages, crispy rice snacks, pregnancy multivitamins and more have recently been recalled by Health Canada and the Canadian Food Inspection Agency (CFIA). The CFIA issued a recall on Nov. 1 for Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages due incorrect best-before date. The sausages were distributed in Alberta, British Columbia, New Brunswick, Ontario and Quebec.  CFIA tells people not to use sell, serve or distribute the affected products. Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages have been recalled. The CFIA has issued a recall notice on Oct. 30 for an Italian cheese distributed in Ontario and other Canadian provinces. The Dal Molise brand Burratina soft Italian fresh cheese with creamy centre is being recalled due to “generic E. coli.” Dal Molise brand Burratina Soft Italian Fresh Cheese with Creamy Center recalled due to  Health Canada has issued a recall notice on Nov. 7 for various models of GoveeLife and Govee smart electric space heaters, which were sold through Amazon, due to fire and burn hazards.  The company reported approximately 48,584 units were sold in Canada and approximately 512,500 units were sold in the U.S. from October 2021 through May 2024. As of Oct. 28, the company has received seven reports of overheating in Canada and no report of injuries. In the U.S., the company has received 106 reports of overheating and one report of a “minor burn injury.” There has been one report of a “minor burn injury” in the U.S., and seven reports of overheating  The CFIA has issued a recall notice for various popular bread brands including Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice and Wonder due to “pieces of metal.” The products were sold through Metro, Shoppers Drug Mart, Amazon, Real Canadian Superstore, No Frills, Zehrs, Foodland, FreshCo, and Sobeys locations, as well as through Voilà fulfilment centres. The products have been distributed in Ontario, Newfoundland and Labrador and Quebec. More than three dozen products have been impacted. A full list can be found by visiting the full CFIA recall notice published on Nov. 1. On Oct. 28, a voluntary recall involving Wonder Brands Inc., was issued for bread and bun products sold at Costco and Giant Tiger.  Bread products under the brand names Compliments, Dempster’s, Harvest Gold, Pom and Sunshine involving the firm Bimbo Canada were also recalled on Nov. 5. Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice  The CFIA issued a recall notice on Nov. 6 for Hestars Temple Street Crispy Rice (“Corn flavour”) 108-gram package with UPC code 6 970798 321981 was recalled. It impacts all codes where milk is not declared on the label. The recall was triggered by a consumer complaint. CFIA says there’s been one reported reaction associated with the consumption of this product. The impacted products were distributed in Nova Scotia, Ontario and Quebec. The affected product is being recalled from the marketplace because it contains milk that is not declared on the label. Check to see if you have recalled products, don’t consume recalled products to which you are allergic or sensitive as they may cause a serious or life-threatening reaction. Do not serve, use, sell or distribute recalled products. Recalled products should be thrown out or returned to the location where they were purchased.  Health Canada issued a recall notice on Nov. 7 involving the Quad Lock MAG Battery Pack (QMA-BPK-5000), which is a wireless portable power bank, equipped with chargeable lithium-ion batteries. The battery packs are black and measure approximately 83 by 60 by 16 millimetres. The recall notice indicates the battery pack can experience overheating, melting or heat-related deformation posing a fire hazard to consumers. The company reported that 1,582 units of the affected products were sold in Canada and 13,706 were sold in the United States between April 2023 to September 2024. As of Nov. 1, the company has received no reports of overheating in Canada, and no reports of injuries. In the United States, the company has received three reports of overheating and no reports of injuries. This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Quad Lock. Health Canada recommends people “immediately stop using the product” and contact Quad Lock for a refund or store credit. “Dispose of the product by contacting your municipality for instructions on how to safely transport and dispose of lithium-ion batteries,” the health agency says. Contact your municipality for instructions on how to safely transport and dispose of lithium-ion batteries. Batteries are considered hazardous waste. Do not place them in household garbage. For more information, consumers can contact Quad Lock by telephone toll-free at 833-362-9855, from 9 a.m. to 4 p.m. PT Monday through Friday, by email at recall@quadlock.com.au or online. Quad Lock MAG Battery Pack recalled due to fire hazard. Person holding the battery pack. This recall involves Wolf dual fuel range with infrared griddle available in three sizes with various configurations (including with a stainless steel, white or black door). The serial and model numbers are printed on the rating plate underneath the top of the oven. The recalled ranges have serial numbers from 18517201 to 18868311. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. Serial numbers and models impacted. The recall listing explains a spill of liquids (such as a boiling over) can cause a short-circuit in a plug of an electronic component which controls the griddle. “The griddle can turn on unexpectedly, posing a burn or fire hazard to consumers,” the recall notice says.  This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Wolf Appliance, Inc. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. As of Oct. 22, the company has received three reports of griddles turning on in Canada and no reports of injuries. In the U.S., the company has received 33 reports of griddles turning on and no reports of injuries. Consumers should “immediately stop using” the recalled item and contact Wolf Appliance to schedule a free repair in their home. For more information, consumers can contact Wolf Appliance by telephone at 1-800-200-7820 from 8 a.m. to 4:30 p.m. CT Monday through Friday, by email at support@wolfappliance.com or online at www.wolfappliance.com/recall or www.subzero-wolf.com and click on “Important Recall Information” at the bottom of the website for more information. Health Canada has issued a recall notice for two JAMP Pharma pregnancy multivitamins as the impacted lots “exceed the acceptable intake limit for N-nitroso-folic acid.” The recalling company is listed as JAMP Pharma Corporation. The recall notice indicates the supplements were distributed nationally, according to the recall noticed posted on Nov. 6. Health Canada says products were distributed in Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador, Ontario, Quebec and Saskatchewan. JAMP Pharma Pregnancy Multivitamin and JAMP Pharma Pregnancy Multivitamin Folic 5 are impacted  Health Canada has issued a national recall for Dead Down Wind Broad Spectrum SPF 30 Odourless Lip Balm because it was sold without market authorization. The “unauthorized product” was sold through Amazon and Cabela’s. The Health Canada recall notice indicates the product was sold “without market authorization,” namely a drug identification number in Canada. Health Canada says product was sold ‘without market authorization.’ To see all recalls posted visit the Government of Canada’s recall list featuring recalls issued by Health Canada and the Canadian Food Inspection Agency. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘LANES CLOSED’: Major lane closures on Highway 401, Highway 410 and the QEW trigger warnings to drivers in Mississauga area this weekend Nov. 8-10 and next week Nov. 11-15",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/9/c2/9c2e08e4-55a4-51d4-90bd-c760bbad406d/672e6df020fa0.image.jpg?resize=200%2C92",
    "url": "https://www.bramptonguardian.com/news/lanes-closed-major-lane-closures-on-highway-401-highway-410-and-the-qew-trigger-warnings/article_8b85a2e2-40a1-577e-9ef8-dd4f2d263674.html",
    "description": "Drivers in Peel Region should expect delays or adjust your route due to roadwork on provincial highways for the following routes in the Mississauga area this weekend (Nov. 8-10) and next week Nov. 11 to 15. For more closures and information visit Ontario 511. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Still want to see Taylor Swift’s Toronto Eras Tour? Try winning concert tickets with these new contests",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/8/1c/81c2e36c-b6cf-5545-b8f3-aaf0713cc4d7/672e747404bce.image.jpg?resize=200%2C133",
    "url": "https://www.bramptonguardian.com/news/still-want-to-see-taylor-swifts-toronto-eras-tour-try-winning-concert-tickets-with-these/article_af2a371f-7e74-5861-a58c-7c1989d907dd.html",
    "description": "You still have a chance to win some Taylor Swift’s Eras Tour tickets in Toronto. Six sold-out shows are happening at the Rogers Centre from Nov. 14 to 23, and if you didn’t get your hands on tickets, there are still a few ways to win some. Here’s some of the contests running: — With files from Itai Buenahora \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        New Canada Post stamps pay tribute to young people who worked on farms to help war effort",
    "img": "https://bloximages.chicago2.vip.townnews.com/bramptonguardian.com/content/tncms/assets/v3/editorial/f/8c/f8c2357d-b16e-5753-bdd5-5b156be1f27b/672e4ab629e8f.image.jpg?resize=200%2C91",
    "url": "https://www.bramptonguardian.com/news/new-canada-post-stamps-pay-tribute-to-young-people-who-worked-on-farms-to-help/article_7c45d5cc-f5be-5ee7-8290-18fc99e558e6.html",
    "description": "Ahead of Remembrance Day, Canada Post has issued permanent domestic rate stamps to honour the Farmerettes and Soldiers of the Soil.  The Farmerettes and Soldiers of the Soil played a pivotal role through two world wars “to keep plates — and stomachs — full, both on the battlefield and at home,” according to a Canada Post press release.  Canada took on a leading role during both world wars in producing food for Britain and the Allied troops, and the need for increased production led to the creation of programs recruiting young people across Canada to work on farms. Soldiers of the Soil was among the programs created for teenaged boys toward this initiative in the First World War, while young women joined programs like the Ontario Farm Service Force’s Farmerette Brigade in the Second World War.  The Soldiers of the Soil stamp features an archival photograph, and the Farmerettes stamp features a snapshot taken by Mary Barnaby Fountain.  The pricing for this commemorative issue of stamps are:  The collection is available for purchase on the Canada Post website. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Itai Buenahora is an editorial clerk with Metroland. Reach him\nat ibuenahora@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘We’re liable’: Mississauga blocks bid to lift hockey and hoops ban on city roads",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/1/7f/17faa1d0-2b37-5382-a004-88d9eae9b16a/672ef5bbb0350.image.jpg?resize=200%2C109",
    "url": "https://www.mississauga.com/news/council/we-re-liable-mississauga-blocks-bid-to-lift-hockey-and-hoops-ban-on-city-roads/article_f28398bd-ee25-5c36-a8cd-26c4ab5dffe0.html",
    "description": "It’s game over for a bid to allow sports on Mississauga streets. Road hockey, basketball and other games will remain prohibited after a majority of council voted against a proposal to lift a city ban on playing sports on Mississauga roadways at a Wednesday, Nov. 6 meeting. Mississauga councillor Alvin Tedjo originally brought a motion to allow some sports on streets in June 2023 and says the current rules are being “weaponized by some residents who don’t want to see kids playing in front of homes, whether it’s a cul-de-sac or private road.” “I’m very disappointed,” he said, adding he thought the move to allow kids to play sports on the street would be a “common sense” win for the city. “But it’s been a year and a half and we’ve ended up where I don’t think most residents want us to be.” City staff had recommended removing the section of Mississauga’s traffic bylaw that prohibits playing games and sports on roadways. That would leave the city in a neutral stance on playing sports on the road, effectively neither forbidding or permitting the activity. Council rejected the recommendation in a five to seven vote, with detractors of the proposal saying there were too many risks involved and the recommended position too vague. Mississauga Mayor Carolyn Parrish said she would consider supporting lifting the sports on streets ban if there were “airtight” measures protecting the city “from the chance of one drunk driver whipping around a corner” and potentially hitting kids playing on the road. “We’re liable,” she said at the Nov. 6 meeting. “And it’s not so much the cost. It’s the loss of a life.” The results of a Nov. 6 council vote on removing a ban on sports on Mississauga streets. Five councillors voted to remove the ban and seven to keep it. Toronto and Ottawa currently permit sports on streets with certain conditions. In Toronto, hockey and basketball are allowed on local roads with speed limits of 40 kilometres or less and games aren’t allowed before 9 a.m. and after 8 p.m. In Ottawa, ball hockey is allowed “where the free flow of traffic is not impeded.” Other large Ontario cities, including Brampton, Hamilton and Kitchener prohibit playing sports on city streets. Kingston, Oshawa and London neither allow or forbid sports in the street, under city bylaws. Sports and games on Mississauga streets have been prohibited since 1979. In 2010, the city amended its rules to forbid sports equipment like basketball and hockey nets, as well as skateboard ramps, from being placed on the road. Mississauga resident Karl Marques was in a battle with the city back in 2019 over a basketball net he left on the boulevard in front of his house. Karl Marques and his sons Damian Marques, and Aidan Marques in 2019 by their Meadowvale basketball net. A city bylaw enforcement officer ordered Marques to move the net, but the Meadowvale resident refused, saying the basket was providing an antidote to screen time for his kids and others in the neighbourhood. After a story in the Mississauga News, Marques says the city mostly left him alone. In a recent interview, Marques said he still supports lifting the prohibition of play in city streets. “I think the idea of the city coming and actually handing out tickets to, you know, kids that are playing street hockey or basketball or whatever, it just sounds so crazy to me,” he said. If the staff recommendation had passed, city bylaw officers would have continued to respond to noise and roadway obstruction complaints. According to numbers from the city, complaints about sports playing on the street are rare, making up less than one per cent of the 18,586 service requests to Mississauga’s enforcement office last year. Seven of the 95 complaints the city received about sports playing in the street were about noise, while 88 related to equipment being left on the roadway. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Steve Cornwell is a city hall reporter for the Mississauga\nNews. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘LANES CLOSED’: Major lane closures on Highway 401, Highway 410 and the QEW trigger warnings to drivers in Mississauga area this weekend Nov. 8-10 and next week Nov. 11-15",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/a/b9/ab91eb16-1c09-5721-aa89-751ff4ac7e03/672e6df0402ec.image.jpg?resize=200%2C92",
    "url": "https://www.mississauga.com/news/lanes-closed-major-lane-closures-on-highway-401-highway-410-and-the-qew-trigger-warnings/article_c0df6383-099a-5aba-8310-f573b3f3555a.html",
    "description": "Drivers in Peel Region should expect delays or adjust your route due to roadwork on provincial highways for the following routes in the Mississauga area this weekend (Nov. 8-10) and next week Nov. 11 to 15. For more closures and information visit Ontario 511. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Man with ties to Peel Region linked to sex-trafficking of 2 women",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/e/0f/e0fc4904-83ff-5cbd-8bf8-5b13442117a7/672e3c4ba8e78.image.jpg?resize=200%2C147",
    "url": "https://www.mississauga.com/news/crime/man-with-ties-to-peel-region-linked-to-sex-trafficking-of-2-women/article_1cc3c4ef-31a2-5974-95de-09ff9eb1696c.html",
    "description": "A man with ties to Peel Region has been accused of sex-trafficking two women across the province. In October, Peel police say officers identified two women who were unknown to each other and allege they had been sexually trafficked throughout the Golden Horseshoe area of the province. “The suspect exercised control over aspects of their lives while profiting financially from it,” say police. According to the Peel force, the suspect was residing in the Niagara region and was arrested there. During the execution of search warrants in Thorold, police say a loaded gun, a large amount of ammunition, a drum magazine capable of holding 50 rounds of ammunition and a quantity of controlled substances for the purpose of trafficking were seized. The suspect’s car was also confiscated as it was used in the commission of the human trafficking offences, say police. A 37-year-old man who police say has community ties to Peel but resides in Thorold has been charged with two counts each of procuring, trafficking in persons, advertise sexual services, receive material benefit resulting from trafficking in persons, derive material benefit from sexual services, possession of prohibited device and possession for the purpose of trafficking. He’s also been charged with communicate with anyone for the purpose of obtaining sexual service, knowledge of unauthorized possession of firearm, possession of prohibited or restricted firearm with ammunition and careless use of a fireman. The suspect has also been charged with six counts of possession contrary to order. Investigators believe there may be additional victims, particularly in the Golden Horseshoe area, and are encouraging anyone with information to call 905-453-2121, ext. 3555. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        Mississauga Mayor Carolyn Parrish wants another look at city firework ban after ‘out of control’ Diwali events",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/b/ef/befe358b-1524-505d-9709-6fb61794b476/672d2430381a8.image.jpg?resize=200%2C123",
    "url": "https://www.mississauga.com/news/council/mississauga-mayor-carolyn-parrish-wants-another-look-at-city-firework-ban-after-out-of-control/article_b449189c-c0dd-59b0-b32d-f1e5743d6979.html",
    "description": "Mississauga may once again consider banning fireworks after some city officials say this year’s Diwali celebrations went too far. Mayor Carolyn Parrish says she wants to look at banning fireworks again in Mississauga after Diwali-related celebrations that she described as “out of control” at a Wednesday, Nov. 6 council meeting. She says the ban, if implemented, would likely impact all current city firework holidays that allow residents to set off some retail fireworks without a permit on private property on Diwali, Victoria and Canada Day, Lunar New Year and New Year’s Eve. City staff say they received 229 firework complaints between Oct. 31 and Nov. 2. When fireworks were permitted in Mississauga Thursday, Oct. 31 and Friday, Nov. 1, there were 49 and 108 complaints respectively, according to a city spokesperson.   Diwali’s official firework holiday last year, Sunday, Nov. 12, saw 97 firework-related complaints reported to the city. Parrish, who said as a councillor in 2023 that she would support a ban on private-use fireworks, wants to survey council members for their feelings on a possible prohibition. She says she also wants to determine enforcement and policing costs under current rules. “We’re going to do thorough research because I imagine we’re going to get a pushback from lots of communities if we should decide to do it,” she said. “We have to have our facts and our figures and our numbers and our health concerns all laid out perfectly.” Council discussed a possible city-wide firework ban back in November 2023. A month prior, council opted to add overnight enforcement officers, boost fines and reduce permitted hours for most firework holidays. The city also added New Year’s Eve as an official firework holiday. Firework debris left in Westwood Square in Mississauga following a Diwali gathering on Nov. 12, 2023. Ward 7 Coun. Dipika Damerla spoke against the firework ban last year and did so again at Wednesday’s council meeting. She said she wants to see if the city’s new rules are improving complaint issues and told her fellow councillors that banning fireworks on Diwali would be prohibiting a tradition that’s been in place for thousands of years. “Perhaps we can be leaders,” Damerla said. “Multiculturalism is hard. Can we find a way to keep this going, but just reduce the nuisance value?” Diwali, also called the festival of lights, is celebrated by Hindus, Sikhs and other South Asian communities and is considered one of the most important yearly celebrations for the Indian diaspora. Both Brampton and Caledon prohibited personal fireworks and their sale since 2022. Mississauga licenses firework sellers in the city and prohibits sale locations within 100 metres of public park entrances and schools. The city received 15 complaints related to firework sales and inspected 354 variety stores and businesses selling them between Oct. 22 and Nov. 2, according to a Mississauga spokesperson. City staff said most of the firework use complaints received around this year’s Diwali were in Wards 5, 7 and 11. “Fireworks on Diwali is becoming a big problem. People are not respecting our bylaw,” said Ward 11 Coun. Brad Butt, adding he believes people are setting off fireworks for hours and after 11 p.m., which is the city’s official cutoff time. “It’s not a 15-minute little firework thing anymore,” he said. “It’s hours and hours and the complaints in my office were just incredible this year.” In a statement to the Mississauga News following the meeting, Parrish said there was no specific date for when the firework issue would be back before council. “We’re pretty busy and there’s no rush,” she said. Correction — Nov. 9, 2024: This article has been edited from a previous version that misstated this year’s Diwali firework holidays and updated to include complaint numbers from the city on those dates. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Steve Cornwell is a city hall reporter for the Mississauga\nNews. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        MiWay buses not entering Brampton Gateway Terminal due to CUPE Local 831 strike",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/5/f6/5f60ad9b-de32-51b4-a2d7-9edf0db2d85b/672cdc1177eb1.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/miway-buses-not-entering-brampton-gateway-terminal-due-to-cupe-local-831-strike/article_7d82634e-4aed-542d-9fc6-0976310fc494.html",
    "description": "MiWay buses aren’t entering Brampton Gateway Terminal due to a strike by Brampton city workers represented by CUPE 831. According to the City of Mississauga, MiWay buses will instead service a temporary bus stop on Main Street near the terminal. The detour affects MiWay Route 103 Hurontario Express. “The route will go on detour after it passes Steeles Avenue and Hurontario Street in Brampton,” the City of Mississauga said in a news release Thursday morning. “From Steeles Avenue, the bus will turn onto McMurchy Avenue, then onto Charolais Boulevard and onto Main Street to service the temporary bus stop near the terminal platform.” Route 103 will service all other regular stops along its route. Visit the MiWay service updates webpage for updates on the latest service alerts.  \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Suspicious package prompts evacuation of Mississauga building",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/5/bb/5bba9ae7-e465-5378-8080-8722c6ed6f1f/672cadc1eaaa3.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/suspicious-package-prompts-evacuation-of-mississauga-building/article_45d7fcd6-3166-52ce-9f7b-a63aee952536.html",
    "description": "A suspicious package that prompted the evacuation of a Mississauga building on Wednesday turned out to be packaged protein supplements, say Peel police. A building in the area of Britannia Road East and Infield Tunnel Road was evacuated around 11 a.m. on Nov. 6 after an unknown package was discovered, say police. The service’s explosives disposal unit attended the scene “and the package was cleared, nothing of concern,” said police in an online post. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘Very difficult’: Mississauga could ban protests near places of worship after clashes near Hindu and Sikh temples",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/6/c5/6c555738-1019-5e12-8ba0-ef1d9b06ce66/672bd8e5f091f.image.jpg?resize=200%2C133",
    "url": "https://www.mississauga.com/news/council/very-difficult-mississauga-could-ban-protests-near-places-of-worship-after-clashes-near-hindu-and/article_644570d4-6265-56a2-81e3-18e5c500f890.html",
    "description": "Mississauga may move to ban protests near places of worship after tense and sometime violent clashes recently near Hindu and Sikh temples in Peel. Ward 7 Coun. Dipika Damerla said she wants to create a “bubble zone” around all places of worship in Mississauga to ensure those attending religious services aren’t confronted by demonstrators.  Damerla says she’s been “very disappointed” with the protests and will introduce a motion at a future city council meeting to “make it easy for people who want to worship.” “They shouldn’t have to put up with protests. That can be very difficult,” she said at Wednesday’s Mississauga council meeting. Canada’s Charter of Rights and Freedoms protects the right to gather and protest peacefully, with some limitations including if demonstrators are deemed by authorities to impede or block lawful activities. Damerla said she has been working closely with the city’s legal team to ensure her motion, which will need a majority of councillor support to pass, respects the freedoms of religion and assembly. Mississauga Ward 7 Coun. Dipika Damerla. Mississauga and Brampton have seen a recent spate of violence Peel police say is connected to protests outside local Hindu and Sikh temples. Peel police have arrested and charged at least three men following the protests and suspended an officer amid allegations he was involved in a demonstration at the Hindu Sabha Temple in Brampton. In a statement Tuesday, Peel Regional Police Chief Nishan Duraiappah said the protests have “sparked serious concerns for public safety” and he expects more arrests to come as investigations into the protests continue. “Each incident saw violence and hate. It is unacceptable and has no place in our community,” he said, adding Peel police are committed to ensuring safety around places of worship. Brampton Mayor Patrick Brown said he will also soon introduce a motion that would prohibit demonstrations outside places of worship. In a statement to the Mississauga News, Brown said the recent protests are infringing on the right of religious freedom. “It’s the wrong place to protest,” he said. Anaïs Bussières McNicoll, a director at the Canadian Civil Liberties Association, said the legal advocacy group is closely watching what limitations Brampton and Mississauga may institute. She said police can already break up violent protests with current laws and it’s questionable whether narrowing where people can peacefully demonstrate would be a reasonable limit on the right to assemble. “Picking and choosing locations where peaceful protests are welcome or not might lead to a slippery slope.” Should Brampton and Mississauga pass motions to block protests near places of worship, they would be at least the second and third major GTA city to do so this year. This year, Vaughan passed a bylaw banning protests within 100 metres of what was deemed “vulnerable social infrastructure” such as places of worship, child cares and hospitals. Vaughan Mayor Steven Del Duca advocated for the move after large protests outside of Thornhill synagogues in March that also drew counterprotests. — With files from Veracia Ankrah \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Steve Cornwell is a city hall reporter for the Mississauga\nNews. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Mississauga man charged in $2.2M Toronto auto sales scheme used job at dealership to carry out fraud, say police",
    "img": "https://bloximages.chicago2.vip.townnews.com/mississauga.com/content/tncms/assets/v3/editorial/7/48/748f4404-b30f-56c0-ace3-bbb5d5507373/672ba291b03f9.image.jpg?resize=200%2C115",
    "url": "https://www.mississauga.com/news/crime/mississauga-man-charged-in-2-2m-toronto-auto-sales-scheme-used-job-at-dealership-to/article_83b3b358-3298-596f-838a-d60bc5bd8c28.html",
    "description": "A Mississauga man is one of two people charged by Toronto police in an alleged elaborate auto theft scheme that saw suspects use their employment at a car dealership to fool buyers into purchasing nearly $2.2 million worth of stolen vehicles. The Toronto Police Service announced the results of Project Warden on Nov. 6, outlining an investigation launched in August that resulted in 176 charges and the uncovering of an alleged criminal enterprise worth an estimated $2.188 million. Investigators say two suspects, both employed at a Toronto car dealership, used their positions to acquire and sell stolen vehicles to unsuspecting customers who were led to believe it was a legitimate used vehicle sale. The Toronto force alleges the vehicles would be purchased from numbered companies, some of which police say were owned by the suspects themselves, using funds from the dealership. The suspects would also “create fictitious sales agreements” using “clean” Vehicle Identification Numbers, or VINs, and would then alter Carfax reports to match the fraudulent vehicle information, giving buyers the appearance of a legitimate purchase, say police. The stolen vehicles would then be delivered to a buyer and later the purchaser would realize that the vehicle VIN they received did not match the vehicle they had bought from the suspects, police say. In some cases, added police, some of the sold vehicles were falsely registered to people not listed on the sales documents. During the week of Oct. 21, officers carried out eight search warrants on homes, commercial garages and vehicles where they located and recovered two suspected “re-vinned” vehicles, as well as numerous documents and other electronics used in the fraud and sales of stolen vehicles, say police. Toronto police say the two suspects have been linked to 22 fraudulent vehicles sales conducted while they were working as legitimate car salespeople. A 32-year-old Mississauga man has been charged with 20 counts each of forgery, uttering a forged document, altering document with intent to defraud and fraud over $5,000. He also faces two counts each of trafficking in property obtained by crime over $5,000 and altering or removing a vehicle identification number. A Barrie man, 35, also faces 22 counts each of forgery, uttering a forged document, altering a document with intent to defraud and fraud over $5,000. He too faces two counts each of trafficking in property obtained by crime over $5,000 and alter/remove vehicle identification number. Police believe there may be more victims and anyone with information is asked to call 416-808-5306. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        Ready for some winter fun in Vaughan? WinterFest returns to Canada’s Wonderland",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/2/39/2393aabb-eb14-5724-90bb-f790a096a93f/672df816393ff.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/ready-for-some-winter-fun-in-vaughan-winterfest-returns-to-canada-s-wonderland/article_9175aa56-785f-57d5-8ae9-cad41b3e6ea9.html",
    "description": "The holiday magic of WinterFest returns to Canada’s Wonderland for its fifth season on Nov. 16. The annual holiday event — featuring live shows, enchanted themed areas, millions of lights, and festive food — is open on select dates until Jan. 4, 2025. “Get ready for the biggest, brightest holiday experience around,” said Phil Liggett, general manager in a news release. “WinterFest is a feel-good event for guests of all ages and brings the magic of the season to life. If you haven’t had a chance to see it, this is Canada’s Wonderland like you’ve never seen it before.” This year’s festivities include a nightly tree lighting ceremony, nine live shows, musical performances and interactive attractions like ice skating on Snow Flake Lake, photo ops with Elf on a Shelf and cookie decorating with Mrs. Claus.  Wonderland’s WinterFest returns with more than 40 attractions, including:  Tinker’s Toy Factory: An indoor show at Canterbury Theatre with music, acrobatics and an entertaining story about elf hijinks in Santa’s Workshop.  Rides: Guests can enjoy more than 20 rides, including the children’s rides in Charlie Brown’s Christmas Town, and other favourites like Thunder Run, Klockwerks, Psyclone and Sledge Hammer. Ice Skating on Snow Flake Lake: Attendees can glide down the ice on the shimmering, frozen lake in front of Wonder Mountain and surrounded by lit trees and holiday light projections. Advance online reservations are required. Nightly tree-lighting ceremony: A song-and-dance event on International Street where two 50-foot-tall Christmas trees are lit, and decorated with thousands of lights and ornaments.  Cool Yule Christmas: A high-energy, fun-filled show covering Christmas pop songs. Jack Frost’s Igloo Village: Guests can rent a cosy, private igloo for the evening with concierge food and beverage service. Four Drummers Drumming: Playful toy soldiers drum familiar favourites with the crowd. A PEANUTS™ Guide to Christmas: Guests can join Charlie Brown and the gang in an enjoyable singalong to celebrate the holidays. Elf on the Shelf: Santa’s favourite helper will keep an eye on guests and is happy to pose for photos. Christmas Market: A Christmas market featuring local artisan vendors, food and amazing gift ideas.  Find a full list of shows and attractions, operating hours, tickets and reservations for WinterFest 2024 here. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Veracia Ankrah is a reporter with YorkRegion.com. Reach her at\nvankrah@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Got mail? Here are other mail and shipping options for Canadians as potential Canada Post strike looms",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/3/9c/39c56c23-bdfc-50b2-b1b3-6b9800132ed6/672e8033e2cd0.image.jpg?resize=200%2C130",
    "url": "https://www.durhamregion.com/news/got-mail-here-are-other-mail-and-shipping-options-for-canadians-as-potential-canada-post/article_ec8c8a2b-2111-5a2c-9bd6-a4d5f0401b34.html",
    "description": "As the threat of a possible work stoppage at Canada Post looms ahead of the holidays, you may be wondering what other shipping services are available to you. There are numerous options actually. Canada Post and the union representing its postal workers are negotiating a new collective agreement. While neither side has issued a notice of strike or lockout, both parties are in a legal position to do so. They must provide a minimum of 72 hours’ notice before a labour disruption can occur. Canada Post has said the threat of this labour disruption has already impacted its business, as volumes and revenue are down ahead of what’s usually a busy holiday shipping season. So, if you are feeling nervous about using Canada’s postal service, even as it continues to deliver the mail, below are some options available to you for shipping within Canada and internationally. U.S.-based global shipping company FedEx offers Canada-wide and international shipping services. It consists of express delivery and includes next-day delivery to most metropolitan areas, to standard ground and freight services. If you need to send items to the United States or other international markets, FedEx has standard shipping and express options, including next-day shipping to many locations within the U.S. More information is available at fedex.com. While Canada Post is the majority owner of Purolator, the workers at this Canadian courier company are represented by a different union than those at Canada Post. So any strike action at Canada Post will not impact Purolator’s services. The shipping company can deliver packages to, from and within Canada and to more than 210 countries. With more than 2,500 authorized shipping agents in Canada, finding a location is as easy as finding a local pharmacy. More information is available at purolator.com. Another U.S.-based company, UPS provides global shipping and logistics services. Canadians can use it for domestic and international shipping, including same-day delivery options as well as freight shipping options. The company also offers Saturday delivery in Canada. More information is available at ups.com. What launched as a local delivery business in the Toronto area in the 1980s has grown to become a courier transportation and logistics company serving all of Canada as well as in the U.S., with a focus on serving health-care, IT and retail businesses. More information is available at appleexpress.com. The DHL international courier service provider, which is owned by Germany’s Deutsche Post, provides services for international shipping from Canada. DHL has document and parcel services for all shippers, as well as retailer and volume shipping and cargo shipping for businesses. More information is available at dhl.com. ShippingChimp provides shipping services anywhere in Canada and the U.S., as well as to destinations in other parts of the world, with a focus on eCommerce shipping solutions for small businesses. More information is available at shippingchimp.com. DTDC Express Canada, which is part of India’s largest parcel delivery network, is a courier specializing in cross-border eCommerce services. It has a direct presence in 21 countries, including the U.S. and U.K., and with operations, through associates, in many other countries. More information is available at canada.dtdc.com. Quebec-based last-kilometre logistics company Intelcom, which operates as Dragonfly outside Quebec, utilizes independent delivery partners to handle up to 600,000 daily deliveries in 10 provinces and two territories. The company has numerous stations in Ontario. More information is available at intelcom.ca. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ontario, Canada recalls: Space heaters sold on Amazon, Wolf griddle, lip balm, Johnsonville sausages, bread sold at Sobeys, FreshCo, Foodland, Metro, Shoppers Drug Mart and more",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/1/ed/1edf91b8-d7cc-5bf0-8862-bf7c9a51c6df/672e75d54af35.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/ontario-canada-recalls-space-heaters-sold-on-amazon-wolf-griddle-lip-balm-johnsonville-sausages-bread/article_5a866499-d67b-5e69-a7f2-aea2345900c6.html",
    "description": "Thousands of space heaters sold on Amazon, battery packs, various bread and buns sold at major Ontario grocery stores, Wolf griddle, Johnsonville sausages, crispy rice snacks, pregnancy multivitamins and more have recently been recalled by Health Canada and the Canadian Food Inspection Agency (CFIA). The CFIA issued a recall on Nov. 1 for Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages due incorrect best-before date. The sausages were distributed in Alberta, British Columbia, New Brunswick, Ontario and Quebec.  CFIA tells people not to use sell, serve or distribute the affected products. Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages have been recalled. The CFIA has issued a recall notice on Oct. 30 for an Italian cheese distributed in Ontario and other Canadian provinces. The Dal Molise brand Burratina soft Italian fresh cheese with creamy centre is being recalled due to “generic E. coli.” Dal Molise brand Burratina Soft Italian Fresh Cheese with Creamy Center recalled due to  Health Canada has issued a recall notice on Nov. 7 for various models of GoveeLife and Govee smart electric space heaters, which were sold through Amazon, due to fire and burn hazards.  The company reported approximately 48,584 units were sold in Canada and approximately 512,500 units were sold in the U.S. from October 2021 through May 2024. As of Oct. 28, the company has received seven reports of overheating in Canada and no report of injuries. In the U.S., the company has received 106 reports of overheating and one report of a “minor burn injury.” There has been one report of a “minor burn injury” in the U.S., and seven reports of overheating  The CFIA has issued a recall notice for various popular bread brands including Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice and Wonder due to “pieces of metal.” The products were sold through Metro, Shoppers Drug Mart, Amazon, Real Canadian Superstore, No Frills, Zehrs, Foodland, FreshCo, and Sobeys locations, as well as through Voilà fulfilment centres. The products have been distributed in Ontario, Newfoundland and Labrador and Quebec. More than three dozen products have been impacted. A full list can be found by visiting the full CFIA recall notice published on Nov. 1. On Oct. 28, a voluntary recall involving Wonder Brands Inc., was issued for bread and bun products sold at Costco and Giant Tiger.  Bread products under the brand names Compliments, Dempster’s, Harvest Gold, Pom and Sunshine involving the firm Bimbo Canada were also recalled on Nov. 5. Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice  The CFIA issued a recall notice on Nov. 6 for Hestars Temple Street Crispy Rice (“Corn flavour”) 108-gram package with UPC code 6 970798 321981 was recalled. It impacts all codes where milk is not declared on the label. The recall was triggered by a consumer complaint. CFIA says there’s been one reported reaction associated with the consumption of this product. The impacted products were distributed in Nova Scotia, Ontario and Quebec. The affected product is being recalled from the marketplace because it contains milk that is not declared on the label. Check to see if you have recalled products, don’t consume recalled products to which you are allergic or sensitive as they may cause a serious or life-threatening reaction. Do not serve, use, sell or distribute recalled products. Recalled products should be thrown out or returned to the location where they were purchased.  Health Canada issued a recall notice on Nov. 7 involving the Quad Lock MAG Battery Pack (QMA-BPK-5000), which is a wireless portable power bank, equipped with chargeable lithium-ion batteries. The battery packs are black and measure approximately 83 by 60 by 16 millimetres. The recall notice indicates the battery pack can experience overheating, melting or heat-related deformation posing a fire hazard to consumers. The company reported that 1,582 units of the affected products were sold in Canada and 13,706 were sold in the United States between April 2023 to September 2024. As of Nov. 1, the company has received no reports of overheating in Canada, and no reports of injuries. In the United States, the company has received three reports of overheating and no reports of injuries. This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Quad Lock. Health Canada recommends people “immediately stop using the product” and contact Quad Lock for a refund or store credit. “Dispose of the product by contacting your municipality for instructions on how to safely transport and dispose of lithium-ion batteries,” the health agency says. Contact your municipality for instructions on how to safely transport and dispose of lithium-ion batteries. Batteries are considered hazardous waste. Do not place them in household garbage. For more information, consumers can contact Quad Lock by telephone toll-free at 833-362-9855, from 9 a.m. to 4 p.m. PT Monday through Friday, by email at recall@quadlock.com.au or online. Quad Lock MAG Battery Pack recalled due to fire hazard. Person holding the battery pack. This recall involves Wolf dual fuel range with infrared griddle available in three sizes with various configurations (including with a stainless steel, white or black door). The serial and model numbers are printed on the rating plate underneath the top of the oven. The recalled ranges have serial numbers from 18517201 to 18868311. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. Serial numbers and models impacted. The recall listing explains a spill of liquids (such as a boiling over) can cause a short-circuit in a plug of an electronic component which controls the griddle. “The griddle can turn on unexpectedly, posing a burn or fire hazard to consumers,” the recall notice says.  This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Wolf Appliance, Inc. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. As of Oct. 22, the company has received three reports of griddles turning on in Canada and no reports of injuries. In the U.S., the company has received 33 reports of griddles turning on and no reports of injuries. Consumers should “immediately stop using” the recalled item and contact Wolf Appliance to schedule a free repair in their home. For more information, consumers can contact Wolf Appliance by telephone at 1-800-200-7820 from 8 a.m. to 4:30 p.m. CT Monday through Friday, by email at support@wolfappliance.com or online at www.wolfappliance.com/recall or www.subzero-wolf.com and click on “Important Recall Information” at the bottom of the website for more information. Health Canada has issued a recall notice for two JAMP Pharma pregnancy multivitamins as the impacted lots “exceed the acceptable intake limit for N-nitroso-folic acid.” The recalling company is listed as JAMP Pharma Corporation. The recall notice indicates the supplements were distributed nationally, according to the recall noticed posted on Nov. 6. Health Canada says products were distributed in Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador, Ontario, Quebec and Saskatchewan. JAMP Pharma Pregnancy Multivitamin and JAMP Pharma Pregnancy Multivitamin Folic 5 are impacted  Health Canada has issued a national recall for Dead Down Wind Broad Spectrum SPF 30 Odourless Lip Balm because it was sold without market authorization. The “unauthorized product” was sold through Amazon and Cabela’s. The Health Canada recall notice indicates the product was sold “without market authorization,” namely a drug identification number in Canada. Health Canada says product was sold ‘without market authorization.’ To see all recalls posted visit the Government of Canada’s recall list featuring recalls issued by Health Canada and the Canadian Food Inspection Agency. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Still want to see Taylor Swift’s Toronto Eras Tour? Try winning concert tickets with these new contests",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/f/fd/ffd929c6-fa09-5d9b-9523-188acc65855f/672e74740d643.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/still-want-to-see-taylor-swifts-toronto-eras-tour-try-winning-concert-tickets-with-these/article_50361ad4-a76f-5a1c-8419-9b2e879dad5a.html",
    "description": "You still have a chance to win some Taylor Swift’s Eras Tour tickets in Toronto. Six sold-out shows are happening at the Rogers Centre from Nov. 14 to 23, and if you didn’t get your hands on tickets, there are still a few ways to win some. Here’s some of the contests running: — With files from Itai Buenahora \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        New Canada Post stamps pay tribute to young people who worked on farms to help war effort",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/3/44/34440073-a961-5271-862f-f8920b8a74ef/672e4ab625f5f.image.jpg?resize=200%2C91",
    "url": "https://www.durhamregion.com/news/new-canada-post-stamps-pay-tribute-to-young-people-who-worked-on-farms-to-help/article_6e9dee4e-eaab-5d43-8015-71d4a4611ce8.html",
    "description": "Ahead of Remembrance Day, Canada Post has issued permanent domestic rate stamps to honour the Farmerettes and Soldiers of the Soil.  The Farmerettes and Soldiers of the Soil played a pivotal role through two world wars “to keep plates — and stomachs — full, both on the battlefield and at home,” according to a Canada Post press release.  Canada took on a leading role during both world wars in producing food for Britain and the Allied troops, and the need for increased production led to the creation of programs recruiting young people across Canada to work on farms. Soldiers of the Soil was among the programs created for teenaged boys toward this initiative in the First World War, while young women joined programs like the Ontario Farm Service Force’s Farmerette Brigade in the Second World War.  The Soldiers of the Soil stamp features an archival photograph, and the Farmerettes stamp features a snapshot taken by Mary Barnaby Fountain.  The pricing for this commemorative issue of stamps are:  The collection is available for purchase on the Canada Post website. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Itai Buenahora is an editorial clerk with Metroland. Reach him\nat ibuenahora@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ontario’s first Costco sushi bar opens in Brantford, and people are ready for California crab rolls",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/b/85/b8502921-03fb-5112-81e0-641965aef888/672e61e4df231.image.jpg?resize=200%2C150",
    "url": "https://www.durhamregion.com/news/ontarios-first-costco-sushi-bar-opens-in-brantford-and-people-are-ready-for-california-crab/article_e776bf6b-bda0-5a77-8e89-40a523ef05e1.html",
    "description": "A new Costco location opened today (Nov. 8) in Brantford, and there’s an added highlight: a sushi bar. It’s the first Ontario location with a sushi bar, with a Costco spokesperson confirming the only other location with a sushi bar is in Vancouver, B.C. Located at 175 Roy Blvd., near Lynden Park Mall, the warehouse spans 150,000 square feet. Word is, along with prepackaged sushi selections, the food court will also be serving a California eight-piece crab roll, made with Pacific blue crab, Japanese sushi rice, avocado and cucumber. Served with wasabi, soy sauce, ginger and chop sticks. “Congratulations Costco Brantford on your Spectacular Grand Opening,” Brantford Coun. Michael Sullivan said in a Facebook post. The ribbon cutting took place at 6:30 a.m., with people lining up as early as 1:30 a.m. to be the first through the doors, he added. “I’m very proud to be part of this event, as Costco Brantford is the only Costco that is serving chef-plated sushi east of Vancouver,” Sullivan said. “Furthermore, our Costco also has build-your-own sausage and burgers.” According to Vancouver-based Sophia Siyao Hu, an Instagram content creator, the sushi she tried in Vancouver was good. A post shared by Sophia Siyao Hu | Vancouver (@sopheats) “As with everything at Costco, the portion size and value was incredible,” she said in a social post. It’s not known if the same selection of sushi will be available at the Brantford location. And TikTok content creator Laura Ullock shared a video from the Vancouver store, where she purchased the eight-piece California crab roll at the food court for $9.99. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Janis Ramsay is an online editor with Metroland. Reach her at\njramsay@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Maclean’s reveals Canada’s biggest billionaires with Loblaw Companies’ Galen Weston and Lululemon founder among the richest",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/4/00/400e9271-5d5f-5b1f-a8ea-364903001509/672e5f6c23c08.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/macleans-reveals-canadas-biggest-billionaires-with-loblaw-companies-galen-weston-and-lululemon-founder-among-the/article_efc85de7-b01e-5690-8e27-2d9fe59e1f4c.html",
    "description": "When considering Canada’s richest citizens, a few celebrity names may first come to mind — like Ryan Reynolds or Ryan Gosling. But a new list published by MacLean’s magazine and Canadian Business suggests those actors’ salaries are chump change, as it ranks Canada’s billionaires. The people on this list own grocery stores, hotels, restaurants and wineries. You may not have heard all their names, but they’re definitely part of your lives.\n\nMeet Canada’s richest people. https://t.co/4MteFxawLO pic.twitter.com/KZczsXsTXn A few familiar names are on the list. The Thomson family, of the Thomson Corp. media company, has a collective net worth of $98.15 billion, MacLean’s said. Sherry Brydson, a family member and the largest shareholder of Woodbridge — an investment company with Thomson Reuters — is worth more than $19.8 billion alone. Loblaw Companies Ltd., president Galen Weston Jr. is now the third richest Canadian, with a net worth of $18.05 billion. And the family of Ted Rogers — who founded Rogers Communications — has a net worth of $12.47 billion. Lululemon founder Dennis “Chip” Wilson also makes the list, with an approximate net worth of $6.8 billion. Most of the rankings come from publicly traded companies, as collected in the Bloomberg Billionaires Index. The index shared the richest individual Canadian is actually Changpeng Zhao, a financier and former CEO of Binance cryptocurrency company. His estimated net worth is now more than $52.7 billion. Canadian computer scientist, businessperson, philanthropist and venture capitalist David Cheritan has a net worth of approximately $10.4 billion. Alain Bouchard, co-founder and chair of Couche-Tard and the Circle K chain, was further down the list, with an approximate net worth of $7.19 billion. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Rogers Centre selling official Taylor Swift merch, including to fans who don’t have Eras Tour tickets — here’s when and what time to line up",
    "img": "https://bloximages.chicago2.vip.townnews.com/durhamregion.com/content/tncms/assets/v3/editorial/9/fa/9fa13e9f-2374-51f6-a1bc-51e741927fdc/672e5cebc6fa4.image.jpg?resize=200%2C133",
    "url": "https://www.durhamregion.com/news/rogers-centre-selling-official-taylor-swift-merch-including-to-fans-who-don-t-have-eras/article_bbd9938f-5166-5713-83bd-8df233f5d082.html",
    "description": "If you couldn’t score tickets to Taylor Swift’s Eras Tour concert dates in Toronto, you’ll still have an opportunity to buy official merch at the Rogers Centre in Toronto. The stadium announced that it is the only Toronto location with official Taylor Swift Eras Tour merchandise. The pop superstar has six performance dates at the Rogers Centre between Nov. 14 and 23. The Rogers Centre will sell official merchandise on non-show dates to fans, whether they have tickets or not. Below are some things you need to know. Fans can go into the Rogers Centre on these non-show dates: The available hours are from 10 a.m. to 8 p.m. Fans are not permitted to queue before 9 a.m. Location on non-show days to get merch include: All locations have the same merchandise. While there are no concerts on these dates, fans must still adhere to the concert bag policy and cannot bring prohibited items. A full list of prohibited items is available online. Security screening and bag check will be in place. Each shopper is permitted to bring one small bag. Bags must meet one of the following criteria: Shopping bags will not be provided at the Rogers Centre. The stadium asks fans to be prepared for long wait times and dress for the weather outside. The Rogers Centre will also sell merchandise on show dates, but you must have a ticket to the concert on these dates. Concert dates are on Nov. 14, 15, 16, 21, 22 and 23. Merchandise is available at every level of Rogers Centre except Floor Level, once gates open until approximately 45 minutes following the end of the show. Rogers Centre gates open at 4:30 p.m. on show dates and the concerts start 6:45 p.m. Ticket holders are not permitted to arrive or queue before 3:30 p.m. on show days and traffic management will be in place. More information is available online. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Burlington hosting online survey, open houses on short term rentals as it mulls new regulations",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/e/a8/ea8da495-dbe7-5e31-bd6a-c477965f4804/672e653e9f3cd.image.jpg?resize=200%2C133",
    "url": "https://www.insidehalton.com/news/burlington-hosting-online-survey-open-houses-on-short-term-rentals-as-it-mulls-new-regulations/article_3ba1169c-0272-5cec-84ef-b4105554616e.html",
    "description": "One goal of the City of Burlington’s review of short-term rental licensing and regulation is achieving fairness for local businesses. Burlington Chamber of Commerce president Terry Caddo said the chamber is happy to see the city moving ahead with public consultation this month on a short-term rental (STR) bylaw to regulate and license the rental of residences for less than 30 days, usually through platform like Airbnb and Vrbo. While residents and councillors have raised issues for at least five years about short-term rentals being used for “party houses” that disrupt neighbourhoods, Caddo said there’s another aspect to the issue. He noted that STRs, through various platforms, don’t pay the hotel room tax collected to support local tourism. “Short-term rentals are benefitting from (the Municipal Accommodation Tax) but not contributing,” Caddo said.  The city is now seeking public feedback on, and experiences with, short-term rental properties in Burlington to help inform development and implementation of a city-wide Short-Term Rental Compliance and Licensing Program. A staff report is expected to be presented to city council in early 2025. An online survey is open until Nov. 29 and virtual public open houses are scheduled for Tuesday, Nov. 26 at 1:30 p.m. and Wednesday, Nov. 27 at 6:30 p.m. For details, updates, access to the survey and links to the virtual public open houses, go to getinvolvedburlington.ca/strentals. In April 2023, Burlington city council directed staff to develop and implement a city-wide short-term accommodation compliance and licensing program. Currently, there are no regulations specific to short-term rentals in Burlington. Short-term rental properties are held to the same bylaws that regulate the rest of the community, including property standards, noise and parking. Specific zoning requirements for short-term rentals could be implemented. Contributing taxes that support local tourism is one of the issues that could be addressed in a short-term rental bylaw. “The State of Short-Term Rental Regulation in Canada,” an October 2023 University of Calgary study, analyses approaches taken by 25 municipalities across the country. “Taxation is a management tool about which stakeholders in the traditional hospitality industry have been vocal since the emergence and expansion of the STR market,” the report states. “Calling for the extension of existing tourist accommodation and sales taxes to STR operations, hotel associations have argued that without such equalizing measures, STR operators benefit from an uneven playing field that gives them unfair competitive advantage over traditional accommodation providers.” The study states tax requirements are a standard component of most STR frameworks in Canada and represent a significant revenue-raising tool for Canadian governments. Effective regulation is highlighted as a challenge. “There have been multiple different attempts at regulating things and they have had mixed reviews and results,” said Chris Gibbs, associate professor of hospitality and tourism management at Toronto Metropolitan University. The University of Calgary study found some enforcement challenges might come from lack of local staff capacity in some municipalities. “Meaningful enforcement likely requires dedicated staff operating exclusively in the area of short-term rentals. In Canadian jurisdictions, the ability and commitment of local governments to undertake enforcement with the rigour required to achieve high compliance is unclear,” the study states. How extensive and accessible the licensing process is for operators is another challenge. “Low compliance could be linked to a lack of awareness among small-scale operators that they must obtain a business licence to share space in their home: such individuals may not be deliberately avoiding compliance with STR regulations but, at the same time, may not conceive of their participation in the STR market as constituting business activity … that requires a licence for commercial operations,” the study states. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Craig Campbell is a reporter with Metroland, primarily covering\nBurlington. He previously covered the community of Dundas for 25\nyears. Reach him at ccampbell@torstar.ca. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Town of Oakville to start purchasing diesel buses again after 2026",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/9/d1/9d108945-c33e-5b06-9f5e-2348e5c7a8ae/672e846f1d450.image.jpg?resize=200%2C143",
    "url": "https://www.insidehalton.com/news/town-of-oakville-to-start-purchasing-diesel-buses-again-after-2026/article_e5138174-e86b-58ce-a186-97d72db0a9f0.html",
    "description": "The Town of Oakville will switch back to purchasing diesel buses when federal funding for electric buses runs out after 2026. The decision was made by the 2025 Oakville budget committee during their meeting on Oct. 24. In a report to the committee, Oakville Transit director Adrian Kawun noted that with the help of funding from the Investing in Canada Infrastructure Program (ICIP), nearly half of Oakville Transit’s fleet, 74 buses, will be converted to electric by 2026. After that, however, ICIP funding will dry up and Kawun noted that due to the increased costs of electrification, staff recommend that future electric bus purchases be paused. This means that after 2026, purchases of growth and replacement buses would be diesel. “Electric buses cost significantly more than diesel buses and four electric buses are required to replace three diesel buses due to range limits,” said Kawun in his report. “In addition, maintenance costs are higher for battery electric buses.” The Oakville Transit director presented the committee with multiple options. One option, which called for the electrification of the entire Oakville Transit fleet by 2036, despite the lack of ICIP funding, is forecast to cost the town $963 million between 2025 and 2050. Another option would see the budget and purchase of all future replacement and growth buses at a 50 per cent diesel and 50 per cent electric rate. Kawun said this would result in 100 per cent fleet electrification by 2050, but would cost the town $731 million to get there. Ultimately, the committee voted for the cheapest option, which will see the purchase of growth and replacement diesel buses — after ICIP funding is depleted — for $500 million. Under this scenario, existing electric buses that have to be replaced will be replaced with electric buses. Kawun noted town staff are continuing to pursue grant funding to decrease the town’s portion for electrifying the transit fleet. He said the town is looking into the federal government’s Zero Emission Transit Fund, Green Municipal Fund and Canada Public Transit Fund. “Should funding for battery electric buses become available, and the town is successful in its application for funding, staff will provide council an update and recommend a plan to continue the transition of transit buses from diesel to electric,” said Kawun. The first 15 battery-operated buses began arriving in Oakville in 2023. These 20-foot Karsan e-Jest electric buses are currently in use with the town’s care-A-van and Ride On-Demand services. In early 2025, the town will be adding 15 larger-capacity electric buses to its fleet that will service conventional fixed routes. The draft for the 2025 budget notes that a key investment will be $27.5 million for bus replacement and expansion, and refurbishment to existing buses. Another $4.4 million will be used for electric bus charging infrastructure. The draft budget forecasts a property tax increase of 3.92 per cent for 2025 when combined with regional and educational service levies. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 David Lea is a general assignment reporter for\nInsideHalton.com To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        ‘LANES CLOSED’: Significant closures on Highway 403 and QEW trigger warnings to drivers in Burlington and Halton Region area this weekend Nov. 8-10 and next week Nov. 11-15",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/f/e2/fe292fa6-520e-5e33-9289-896d9dccfa97/672e77e3dba56.image.jpg?resize=200%2C92",
    "url": "https://www.insidehalton.com/news/lanes-closed-significant-closures-on-highway-403-and-qew-trigger-warnings-to-drivers-in-burlington/article_82302998-49c5-52ca-8908-60bbbee7d1df.html",
    "description": "Drivers in Halton Region should plan ahead due to roadwork on provincial highways in the Burlington area this weekend (Nov. 8-10) and next week Nov. 11 to 15. For more closures and information visit Ontario 511. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Oakville library design consultation raises concern with some members of Indigenous community",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/e/72/e72856ce-8d8d-5824-9526-3961059e35a7/672e631d582e9.image.jpg?resize=200%2C134",
    "url": "https://www.insidehalton.com/news/oakville-library-design-consultation-raises-concern-with-some-members-of-indigenous-community/article_b4d8dfc8-86e7-5299-9158-2a6d49fcdbaf.html",
    "description": "Consultations surrounding design for the new Oakville Public Library, Central Branch have raised concerns among some members of the local Indigenous community. The branch will be relocated from its present aging facility at 120 Navy St., to the site of the former Oakville post office at 193 Church St., in 2028. The move is intended to enhance accessibility and better serve the community. During the summer, the library announced the architecture firm Perkins&Will Canada had been awarded the design of the new facility and Smoke Architecture would lead “the integration of Indigenous perspectives into the building’s construction and design.” According to a press release Smoke Architecture, an Anishinaabeg-owned and operated firm, will work alongside elders and community leaders to gather knowledge on how to honour distinct Indigenous identities in every step of the process. Jody Harbour, of the Oakville Indigenous non-profit organization Grandmother’s Voice, expressed concerns about this consultation process. “It’s just been moved along really quickly,” she said. “I received an email late Monday night, Thanksgiving, inviting me to a meeting on Wednesday. Right there the flags went up for me … Why all of a sudden is there such a rush to have the Indigenous voices involved?” Harbour couldn’t make that Wednesday meeting but was able to attend another consultation event Oct. 20. She said because of the tight timeline other local Indigenous people she contacted were unable to make this meeting. When reached for comment, Oakville Public Library board CEO Tara Wong acknowledged the initial meeting was rushed and said the library apologized to invitees and is committed to doing better with future sessions. She said engagement (both general and Indigenous) will continue throughout each phase of the project to ensure ideas and feedback are incorporated appropriately. “The Oakville Public Library is deeply committed to truth and reconciliation and to an ongoing journey of learning and allyship to support Indigenous voices and lived experiences, promoting reconciliation within Oakville as we state in our territorial acknowledgment,” said Wong. “Including an indigenous engagement component to the new central project is an important and additional way for the Oakville Public Library to engage with the community to meet this commitment. However, we fully recognize that this can only be done through deep and meaningful conversations and engagements with Indigenous community members.” Harbour also asked, why is she being asked to weigh in on the design when she is not a designer? The library has hired an Indigenous architect who presumably understands the foundational values of Indigenous people. “It just felt performative,” said Harbour of the consultation process. “I don’t feel there is relevance in consulting over the design of a library if you are just going to design a library.” She said a better way this could have been done would have been to invite local Indigenous people in the beginning and ask if they wanted or would approve of an Indigenous component to the library. Harbour said proper consultation is at the beginning and not after committees, conversations and contracts have begun. Wong said the library welcomed Stephen Paquette earlier in October, as an Indigenous knowledge guide, to help support the library’s commitment to truth and reconciliation through the promotion of cultural understanding and strengthening of community connections. She said the library waited until this program was in place to begin the engagement process with Indigenous communities to ensure the library could engage the community meaningfully. “Any concept drawings shown were to elicit conversation about what is possible,” said Wong. “We fully understand that community members are not experts in building design and the role of Smoke Architecture in the engagement process is to be the bridge that connects the feedback and suggestions from community members and translates it into what is possible from a design perspective.” Not everyone in Halton’s Indigenous community believes the library’s consultation process is flawed. Sherry Saevil, who works as an Indigenous Education Advisor for the Halton Catholic District School Board, said she has been involved in this consultation process from the beginning and noted the Oakville Public Library has always been a safe and welcoming space for Indigenous community members. She pointed to the hiring of Smoke Architecture and an Indigenous knowledge guide and said the library is doing what it should be doing regarding these consultations. Saevil said conversations about including Indigenous spaces within the Oakville Public Library have been going on for years and emphasized Grandmother’s Voice does not speak for all Indigenous people in Halton or Oakville. Local Indigenous lecturer John Fletcher has also expressed some concerns about the consultation process. He emphasized the importance of Oakville Indigenous people having their views and comments recognized and questioned why Indigenous people from other parts of Halton and beyond are being asked to consult on design aspects for an Oakville library. Wong said the community members being consulted may include not only Oakville residents but residents from Halton and beyond because the library is also trying to recognize past treaty holders, those Indigenous Peoples that lived in Oakville historically. Others taking part in the consultation, Wong said, are key partners who may not be from Oakville but have worked with the library previously on past programs. Fletcher said the process has been somewhat confusing and noted it is unclear whether what is built will just be a library or some kind of cultural centre that features components such as a sweat room or a prayer room. “These are very spiritual and traditional things that can’t be combined with non-Indigenous areas,” said Fletcher. Wong said the design program does not include any type of centre and any Indigenous placemaking features would only be incorporated into the final design through the Indigenous engagement process. “This is a new process for the Oakville Public Library and we welcome feedback from the community,” said Wong. “We are committed to refining and improving the process as we move through the multi-year project.” \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 David Lea is a general assignment reporter for\nInsideHalton.com To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        2 charged with vehicle theft following Halton Hills police chase",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/6/52/652d7469-34cf-5b39-9106-293c5d9851c4/672e5c09b5b36.image.jpg?resize=200%2C134",
    "url": "https://www.insidehalton.com/news/crime/2-charged-with-vehicle-theft-following-halton-hills-police-chase/article_4f4bf464-2d7b-580f-becc-e935f8126ce5.html",
    "description": "Two people have been arrested following an attempted auto theft in Halton Hills on Thursday, Nov. 7. At around 4:44 a.m., two individuals approached a residence in the Miller Drive and Eaton Street area and attempted to steal a vehicle in the driveway, police said in a press release. This attempt failed, the suspects were spotted and Halton police were called. Police said that when they arrived in the area, they witnessed the suspect vehicle trying to leave. Officers reportedly deployed a tire deflation device; however, the vehicle continued to flee south on Ninth Line before coming to a stop at Steeles Avenue. It’s alleged the two suspects attempted to get away on foot, but were quickly apprehended by police. Police said an investigation determined the suspect vehicle, a Toyota Tundra pickup truck, had been reported stolen from Durham Region a few hours earlier. A 16-year-old male from Markham has been charged with theft of a motor vehicle, possession of property obtained by crime over $5,000, possession of a device for the purpose of committing theft, possession of break-in tools, possession of cannabis while under 19, obstructing a peace officer and three counts of failing to comply with a release order. A 26-year-old man from Oshawa has been charged with theft of a motor vehicle, possession of property obtained by crime over $5,000, possession of a device for the purpose of committing theft, possession of break-in tools, dangerous operation of a motor vehicle, flight from a police officer and driving with cannabis in an open container. Both individuals are being held in custody pending a bail hearing in Milton. Anyone with information regarding this investigation is asked to contact Halton police at 905-825-4777, ext. 2416. Tips can also be submitted anonymously to Crime Stoppers at 1-800-222-TIPS (8477) or through the web at haltoncrimestoppers.ca. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        2 arrested following violent home invasion in Oakville",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/7/65/76577617-e1ca-5132-b118-df439210d245/672e419c7d3ea.image.jpg?resize=200%2C100",
    "url": "https://www.insidehalton.com/news/crime/2-arrested-following-violent-home-invasion-in-oakville/article_ad8aed61-74dd-5de1-8875-7e2fe38362d6.html",
    "description": "Two arrests have been made following a home invasion and assault, which took place in Oakville on Thursday, Nov. 7. At around 2:25 a.m., multiple suspects approached a home on Bellwood Avenue and forced open the front door, Halton Regional Police said in a press release. It’s alleged the suspects made their way to a bedroom, where they confronted an adult male resident and demanded money. Police said during this confrontation the resident was struck on the head, face and upper body. The intruders were able to get keys to a Mercedes-Benz sedan parked in the driveway and they fled the area in the stolen vehicle, police said.  The resident was taken to hospital with non-life-threatening injuries. Halton police were contacted and the investigation that followed resulted in two men being arrested in Toronto in the late afternoon of the same day. The stolen vehicle was also recovered. An 18-year-old man from Vaughan has been charged with aggravated assault, robbery, breaking and entering, possession of property obtained by crime over $5,000, escaping lawful custody, theft of a motor vehicle, wearing a disguise with intent, fraudulent use of a credit card and failing to comply with a release order. An 18-year-old man from Brampton has been charged with aggravated assault, robbery, breaking and entering, possession of property obtained by crime over $5,000, escaping lawful custody, theft of a motor vehicle and wearing a disguise with intent. Both men are being held in custody pending a bail hearing in Milton. “Breaking into a residence at 2 a.m., violently assaulting a sleeping resident while he lays in his bed, all in an effort to steal his car. Incomprehensible,” said Halton police Supt. Dave Costantini in a press release. “Our officers will continue to relentlessly pursue all those who threaten the safety and security of our residents.” Police said they are seeking additional suspects and the investigation is ongoing. Anyone with information regarding this investigation or anyone that may have witnessed suspicious vehicles or persons in the area of Bellwood Avenue, Constance Drive and Duncan Road around the time of the incident is asked to contact the Oakville criminal investigations bureau at 905-825-4777, ext. 2216. Tips can also be submitted anonymously to Crime Stoppers at 1-800-222-TIPS (8477) or through the web at haltoncrimestoppers.ca. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        ‘Disrupts critical habitat’: Burlington loose leaf collection costs $820,000",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/0/ad/0ad1a3a6-82aa-58ea-8c61-b9480dc26b57/672bdf421c705.image.jpg?resize=200%2C123",
    "url": "https://www.insidehalton.com/news/disrupts-critical-habitat-burlington-loose-leaf-collection-costs-820-000/article_e4a4e693-fc47-5b25-a0de-25ba1abfebe1.html",
    "description": "A three-week program to collect loose leaves from Burlington’s streets later this month is expected to cost hundreds of thousands of dollars — but it’s a program some say needs to adapt or scrapped all together. Staff with the City of Burlington confirmed the 2024 budget for the loose leaf collection program, which has operated for 30 years, is approximately $820,000, with that money coming via property taxes. Burlington residents can move loose leaves to the side of the road where city staff will collect them at specified times throughout November. Matt Koevoets, Burlington’s manager of road operations, said the city’s program “supplements” Halton Region’s bagged leaf and yard waste collection, which is also funded by property taxes. “It is put in place to help residents in areas where leaf drop volumes are very high, and where it would not be convenient to bag (and) collect through the Region’s yard waste collection service,” he said. Halton Region collects yard waste every other week between March and December in urban areas. Collected leaves are taken to a Halton Region waste management site in Milton and composted along with yard waste. The 2024 budget for the region’s collection and processing of bagged leaves and yard waste is $3.6-million, an average cost of approximately $2.40 in property taxes per $100,000 in current value assessment for residential properties, Halton staff said. Environmental organizations, however, suggest property owners should keep those leaves on their properties. Sue Alksnis, BurlingtonGreen volunteer, fundraising and community engagement manager, said the organization promotes benefits of leaving as many leaves in yards and gardens as possible. “If everyone with a yard designates some locations where leaves can be left on the ground over the winter, we’ll collectively provide more habitat supporting our valued pollinators,” Alksnis said. “In order to reduce emissions and burning of fossil fuels, the frequency of leaf pick up services can be minimized so that collection vehicles spend less time on our roads.” The David Suzuki Foundation website suggests that rather than raking leaves, leave them in place because dead leaves provide a “nursery” for insects, a home for butterfly larvae and shelter microbes and worms. “Let your rake collect dust,” the foundation website states. “Raking yards has become a habitual gardening practice that disrupts critical habitat for overwintering pollinators.” The site states a thick layer of leaves provides insulation against cold weather and protects newly planted perennials. Burlington resident Stephen White, a member of the Burlington Residents’ Action Group, said the group is examining the loose leaf service. “We are evaluating whether or not we feel it should continue in its present setup,” White stated in an email. “We haven’t officially formulated a policy on this yet.” But as long-term resident, White said he is familiar with the service. “I personally bag half my leaves and dig the other half into my vegetable garden and composter,” he said. “I also have a storm drain in front of my house that I need to keep clear, so I don’t rake my leaves into the road for vacuuming.” White said a problem with the service, depending on where you live, is that collection occurs so late in the year that leaves may blow away or freeze onto the road. “That said, we are also mindful of the fact that in some parts of the city there are many older residents with mature trees on their property who do rely on this service,” White said. “Whether or not there is a better way to address their needs is an important question.” Burlington is divided into three zones, where loose leaf collection is scheduled between Nov. 11 and 29. Residents can place loose leaves at the curb, shoulder or boulevard no more than two days before their zone’s collection date. Those using the service are asked not to block sidewalks or bike lanes, or crowd traffic lanes with leaves. The city reminds residents not to place leaves in ditches or over catch basins. For more information on Burlington’s loose leaf collection program, including collection weeks for each zone, visit the city’s website. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Craig Campbell is a reporter with Metroland, primarily covering\nBurlington. He previously covered the community of Dundas for 25\nyears. Reach him at ccampbell@torstar.ca. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Burlington Tuck Creek flood mitigation project restricts New Street lane for six months",
    "img": "https://bloximages.chicago2.vip.townnews.com/insidehalton.com/content/tncms/assets/v3/editorial/8/e3/8e399023-849f-5feb-9868-6e9ee142b94d/672bbf3268ecb.image.jpg?resize=200%2C105",
    "url": "https://www.insidehalton.com/news/burlington-tuck-creek-flood-mitigation-project-restricts-new-street-lane-for-six-months/article_8dd9f1d7-6877-5d49-84b0-88fdf5477f33.html",
    "description": "A single lane restriction will be in place on New Street for the next six months during water main replacement under Tuck Creek in Burlington. The Tuck Creek flood mitigation project is scheduled to continue from November through to May 2025 and includes replacing approximately 112 metres of water main — with 40 metres installed under Tuck Creek through bedrock using trenchless technology. The lane restriction will be in place on the westbound curb-lane on New Street between Woodview and Elwood roads. The new water main will be installed lower than existing infrastructure to allow future replacement and widening of the Tuck Street-New Street bridge next year. In August, engineering services director Scott Hamilton said this bridge did not contribute to July 2024 flooding, but its widening will help reduce future flooding risks. The project was awarded on Oct. 1 at a cost of just over $1.9 million to Vaughan-based KAPP Infrastructure Inc. For more information on the project, visit burlington.ca/newstwatermain. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. Craig Campbell is a reporter with Metroland, primarily covering\nBurlington. He previously covered the community of Dundas for 25\nyears. Reach him at ccampbell@torstar.ca. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        萬錦在加拿大最佳外賣城市中排名第五，僅次於溫哥華",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/9/5b/95bbec8f-6d76-5228-84a9-fac7d43523e8/670e91d67e907.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/life/food-and-drink/article_9af8efec-b47d-5f58-a527-c0362207f8d3.html",
    "description": "This story is part of a new initiative to provide content to our Chinese readers. You can find the English version here. 隨著外賣成為加拿大日常生活中越來越重要的一部分，新的研究揭示了在哪裏你可以找到最好的披薩、漢堡和雞翅。  你猜怎麼著？ 萬錦在全國外賣城市中排名第五，僅落後於排名第四的溫哥華。 多虧了像Uber Eats這樣的外賣應用，加拿大人現在只需動動手指就可以享受最喜歡的食物，而萬錦市的美食便利性和多樣性在這個領域大放異彩。Spincasino.ca通過分析可獲得性和可負擔性，揭示了加拿大最適合外賣的城市。 萬錦市憑藉多元的餐飲選擇脫穎而出。 這項研究從Uber Eats中提取了數據，考察了提供披薩、漢堡和雞翅等熱門外賣菜品的餐廳數量以及平均價格。萬錦在多樣性和便利性方面得分很高，為居民提供了豐富的美味選擇。 多倫多的怡陶碧谷名列全國外賣最佳城市榜首，其次是多倫多和士嘉堡。 一些有趣的研究結果 士嘉堡在披薩方面拔得頭籌，擁有447家披薩店，是全加拿大最多的城市，平均價格為14.85加元。 多倫多在漢堡和雞翅方面均領先，全市共有445家漢堡店和422家雞翅店。平均每個芝士漢堡的價格為15.07加元，而雞翅的價格為14.66加元。 \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Scarlett Liu is a Local Journalism Initiative reporter covering\nnews in Markham and Richmond Hill, with a focus on the Chinese\ncommunity. She speaks English and Chinese. The LJI supports the\ncreation of original civic journalism. Scarlett\nLiu是多倫多星報旗下社區新聞的一名Local Journalism\nInitiative記者，她主要負責萬錦市和烈治文山市的社區新聞，特別關注華裔社區，可以講中英雙語。Local Journalism\nInitiative旨在支持原創新聞，以滿足加拿大各地，不同社區的新聞需求。作為這個倡議的一部分，並且為了更好地服務華人社區，yorkregion.com\n現推出精選文章中文版，希望大家支持。 To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Vaughan animal shelter hosting adoption clinic with reduced fees",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/d/7a/d7a0be46-5a25-54b4-8c87-1a1f207ebbfc/669ab1878a8da.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/vaughan-animal-shelter-hosting-adoption-clinic-with-reduced-fees/article_4694cffa-e977-5c39-b070-aa27d9b534e4.html",
    "description": "The Vaughan animal shelter is hosting an animal adoption clinic Sunday, Nov. 17 from 10 a.m. to 3 p.m. The local shelter, located at 70 Tigi Crt., Unit 47, has plenty of cats and dogs in its care that are looking for a new permanent home.  Residents can attend the community event without booking an appointment. Vaughan Animal Services (VAS) is offering reduced adoption fees during the event and will be charging $50 for cats and $100 for dogs. Kittens and puppies will also be available for the regular adoption fee of $175 for kittens and $275 for puppies. VAS says the fee covers the cost of rabies vaccines, sterilization and microchip implantation. For Vaughan residents, the fees include the first annual pet licence. Debit and credit cards will be accepted at the animal adoption clinic but not cash. The following criteria is required to adopt an animal at the clinic: Attendees looking to adopt a cat are reminded to bring a carrier to safely transport the feline. VAS says those looking to adopt dogs should bring household members to meet the animal, and once applications are approved, new dog owners will be notified within the week to book an appointment and pick up their new pet. Get a sneak peek of cats and dogs available for adoption here. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Veracia Ankrah is a reporter with YorkRegion.com. Reach her at\nvankrah@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Magna International’s Neighbourhood Network kicks off holiday gift drive",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/3/1f/31f9b75b-8f13-5a94-b62f-bd4f69eb285e/672cc83d3b3b4.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/magna-internationals-neighbourhood-network-kicks-off-holiday-gift-drive/article_8c1e3084-b34e-5e5d-8345-78252012b6c2.html",
    "description": "We’re sharing this information with you, even though we didn’t write it. It was provided by Neighbourhood Network. This copy was reviewed and edited by the Metroland editorial team. The countdown to the holiday season has already begun, and Neighbourhood Network’s elves are ready to spread joy through their annual Holiday Gift Drive!  Last year, this program supported more than 440 individuals in their partnered municipalities of Aurora, East Gwillimbury, Georgina, King Township, Newmarket, and Whitchurch-Stouffville. This year, with an increased need for support, they are gearing up to make an even greater impact. You can be a part of this initiative in two ways: sponsor a family or make a general donation. “We’re always moved by the community’s willingness to give,” shares Erin Cerenzia, manager of community relations. “This program is designed to make it easy for everyone to join in — whether you’re choosing items from our virtual lists or personally shopping for a family, each gift truly lights up someone’s holiday.” All sponsored families reside in Neighbourhood Network’s catchment area and are vetted through their partnered charitable organizations. Urgently needed donations include gift cards, new and unwrapped toys, winter wear, toiletries, and diapers, which are crucial for fulfilling the wishes of their 400-plus charitable partners. “For some families, even basic essentials are out of reach. Each donation, no matter the size, brings real hope and comfort to neighbours who are facing challenging times this season,” Cerenzia said. Donations can be dropped off at two locations until Dec. 11: The Holiday Gift Drive embodies the spirit of giving within our community. Your participation can make this season merry for your neighbours and leave a lasting impact. For more information, visit nnetwork.org/HGD. Neighbourhood Network is a department of Magna International that multiplies community giving and creates caring and vibrant neighbourhoods through promoting volunteerism, linking resources, and supporting local charities and agencies. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ready for some winter fun in Vaughan? WinterFest returns to Canada’s Wonderland",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/f/06/f0635766-3baf-5424-8917-f0fbadbbfba4/672d363d7764a.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/ready-for-some-winter-fun-in-vaughan-winterfest-returns-to-canada-s-wonderland/article_db7f290a-135c-5751-b10e-d76c5f06f38b.html",
    "description": "The holiday magic of WinterFest returns to Canada’s Wonderland for its fifth season on Nov. 16. The annual holiday event — featuring live shows, enchanted themed areas, millions of lights, and festive food — is open on select dates until Jan. 4, 2025.  “Get ready for the biggest, brightest holiday experience around,” said Phil Liggett, general manager in a news release. “WinterFest is a feel-good event for guests of all ages and brings the magic of the season to life. If you haven’t had a chance to see it, this is Canada’s Wonderland like you’ve never seen it before.” This year’s festivities include a nightly tree lighting ceremony, nine live shows, musical performances and interactive attractions like ice skating on Snow Flake Lake, photo ops with Elf on a Shelf and cookie decorating with Mrs. Claus.  Wonderland’s WinterFest returns with more than 40 attractions, including:  Tinker’s Toy Factory: An indoor show at Canterbury Theatre with music, acrobatics and an entertaining story about elf hijinks in Santa’s Workshop.  Rides: Guests can enjoy more than 20 rides, including the children’s rides in Charlie Brown’s Christmas Town, and other favourites like Thunder Run, Klockwerks, Psyclone and Sledge Hammer. Ice Skating on Snow Flake Lake: Attendees can glide down the ice on the shimmering, frozen lake in front of Wonder Mountain and surrounded by lit trees and holiday light projections. Advance online reservations are required. Nightly tree-lighting ceremony: A song-and-dance event on International Street where two 50-foot-tall Christmas trees are lit, and decorated with thousands of lights and ornaments.  Cool Yule Christmas: A high-energy, fun-filled show covering Christmas pop songs. Jack Frost’s Igloo Village: Guests can rent a cosy, private igloo for the evening with concierge food and beverage service. Four Drummers Drumming: Playful toy soldiers drum familiar favourites with the crowd. A PEANUTS™ Guide to Christmas: Guests can join Charlie Brown and the gang in an enjoyable singalong to celebrate the holidays. Elf on the Shelf: Santa’s favourite helper will keep an eye on guests and is happy to pose for photos. Christmas Market: A Christmas market featuring local artisan vendors, food and amazing gift ideas.  Find a full list of shows and attractions, operating hours, tickets and reservations for WinterFest 2024 here. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Veracia Ankrah is a reporter with YorkRegion.com. Reach her at\nvankrah@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Here’s a list of road closures, disruptions in Vaughan for November 2024",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/6/af/6af83033-a4ff-5216-936a-ba7a90f2e50a/672e684c177a0.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/heres-a-list-of-road-closures-disruptions-in-vaughan-for-november-2024/article_cf3a90f2-2418-5720-a545-fae161c0993e.html",
    "description": "Vaughan is undergoing several road closures and disruptions this month.  Vaughan is installing a new water main on Islington Avenue in the Kleinburg Village. The city says daily closures are underway to complete the work until Nov. 15, from 7 a.m. to 5 p.m., and that access to residences and businesses along Islington Avenue will not be impacted.  The southbound traffic on Islington Avenue from Highway 27 will be redirected south on Highway 27, while southbound traffic from Treelawn Boulevard will be redirected north to Highway 27. Northbound traffic on Islington Avenue may also be redirected west to Nashville Road. Vaughan adds that work may take place overnight to minimize disruptions to businesses and pedestrians and that, during the day, flag persons and detour signs will be in place to guide traffic.  A road closure has been taking place on Thornridge Drive, between Yonge Street and Elizabeth Street, since Oct. 28 from 8 a.m. to 5:30 p.m. on weekdays and will continue until Nov. 22, to safely complete utility installation work for the Yonge North Subway Extension. The road is accessible by commuters for the remainder of the day. Metrolinx says signage and barriers are present to guide travellers through the detour routes. Residents can expect noise and vibration from construction vehicles and noticeable equipment while work is underway. Additional improvements to the off-leash dog area in Concord/Thornhill Regional Park located at 299 Racco Pkwy. is undergoing additional improvements, scheduled to begin in late October and last approximately four weeks while weather permits throughout November 2024. The city says construction includes electrical and light pole installation, grading, fence and gate installation and paving. A temporary shared-use area — for large and small dogs — will be available in the park during this time and signage and barriers will be in place to guide visitors.  Check out Vaughan’s full list of closures and disruptions here. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Veracia Ankrah is a reporter with YorkRegion.com. Reach her at\nvankrah@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Got mail? Here are other mail and shipping options for Canadians as potential Canada Post strike looms",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/3/e5/3e522b8d-d3e5-5d63-aeaa-da61425c1686/672e80342f248.image.jpg?resize=200%2C130",
    "url": "https://www.yorkregion.com/news/got-mail-here-are-other-mail-and-shipping-options-for-canadians-as-potential-canada-post/article_56c6ff56-39af-560e-ab74-b5dc54d65e40.html",
    "description": "As the threat of a possible work stoppage at Canada Post looms ahead of the holidays, you may be wondering what other shipping services are available to you. There are numerous options actually.  Canada Post and the union representing its postal workers are negotiating a new collective agreement. While neither side has issued a notice of strike or lockout, both parties are in a legal position to do so. They must provide a minimum of 72 hours’ notice before a labour disruption can occur. Canada Post has said the threat of this labour disruption has already impacted its business, as volumes and revenue are down ahead of what’s usually a busy holiday shipping season. So, if you are feeling nervous about using Canada’s postal service, even as it continues to deliver the mail, below are some options available to you for shipping within Canada and internationally. U.S.-based global shipping company FedEx offers Canada-wide and international shipping services. It consists of express delivery and includes next-day delivery to most metropolitan areas, to standard ground and freight services. If you need to send items to the United States or other international markets, FedEx has standard shipping and express options, including next-day shipping to many locations within the U.S. More information is available at fedex.com. While Canada Post is the majority owner of Purolator, the workers at this Canadian courier company are represented by a different union than those at Canada Post. So any strike action at Canada Post will not impact Purolator’s services. The shipping company can deliver packages to, from and within Canada and to more than 210 countries. With more than 2,500 authorized shipping agents in Canada, finding a location is as easy as finding a local pharmacy. More information is available at purolator.com. Another U.S.-based company, UPS provides global shipping and logistics services. Canadians can use it for domestic and international shipping, including same-day delivery options as well as freight shipping options. The company also offers Saturday delivery in Canada. More information is available at ups.com. What launched as a local delivery business in the Toronto area in the 1980s has grown to become a courier transportation and logistics company serving all of Canada as well as in the U.S., with a focus on serving health-care, IT and retail businesses. More information is available at appleexpress.com. The DHL international courier service provider, which is owned by Germany’s Deutsche Post, provides services for international shipping from Canada. DHL has document and parcel services for all shippers, as well as retailer and volume shipping and cargo shipping for businesses. More information is available at dhl.com. ShippingChimp provides shipping services anywhere in Canada and the U.S., as well as to destinations in other parts of the world, with a focus on eCommerce shipping solutions for small businesses. More information is available at shippingchimp.com. DTDC Express Canada, which is part of India’s largest parcel delivery network, is a courier specializing in cross-border eCommerce services. It has a direct presence in 21 countries, including the U.S. and U.K., and with operations, through associates, in many other countries. More information is available at canada.dtdc.com. Quebec-based last-kilometre logistics company Intelcom, which operates as Dragonfly outside Quebec, utilizes independent delivery partners to handle up to 600,000 daily deliveries in 10 provinces and two territories. The company has numerous stations in Ontario. More information is available at intelcom.ca. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Ontario, Canada recalls: Space heaters sold on Amazon, Wolf griddle, lip balm, Johnsonville sausages, bread sold at Sobeys, FreshCo, Foodland, Metro, Shoppers Drug Mart and more",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/8/08/808f16c4-5600-53ae-a062-6e014e32b3e1/672e75d48c8e0.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/ontario-canada-recalls-space-heaters-sold-on-amazon-wolf-griddle-lip-balm-johnsonville-sausages-bread/article_8c7097cf-2955-503f-b324-21da4aface7a.html",
    "description": "Thousands of space heaters sold on Amazon, battery packs, various bread and buns sold at major Ontario grocery stores, Wolf griddle, Johnsonville sausages, crispy rice snacks, pregnancy multivitamins and more have recently been recalled by Health Canada and the Canadian Food Inspection Agency (CFIA).  The CFIA issued a recall on Nov. 1 for Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages due incorrect best-before date. The sausages were distributed in Alberta, British Columbia, New Brunswick, Ontario and Quebec.  CFIA tells people not to use sell, serve or distribute the affected products. The CFIA has issued a recall notice on Oct. 30 for an Italian cheese distributed in Ontario and other Canadian provinces. The Dal Molise brand Burratina soft Italian fresh cheese with creamy centre is being recalled due to “generic E. coli.” Dal Molise brand Burratina Soft Italian Fresh Cheese with Creamy Center recalled due to  Health Canada has issued a recall notice on Nov. 7 for various models of GoveeLife and Govee smart electric space heaters, which were sold through Amazon, due to fire and burn hazards.  The company reported approximately 48,584 units were sold in Canada and approximately 512,500 units were sold in the U.S. from October 2021 through May 2024. As of Oct. 28, the company has received seven reports of overheating in Canada and no report of injuries. In the U.S., the company has received 106 reports of overheating and one report of a “minor burn injury.” There has been one report of a “minor burn injury” in the U.S., and seven reports of overheating  The CFIA has issued a recall notice for various popular bread brands including Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice and Wonder due to “pieces of metal.” The products were sold through Metro, Shoppers Drug Mart, Amazon, Real Canadian Superstore, No Frills, Zehrs, Foodland, FreshCo, and Sobeys locations, as well as through Voilà fulfilment centres. The products have been distributed in Ontario, Newfoundland and Labrador and Quebec. More than three dozen products have been impacted. A full list can be found by visiting the full CFIA recall notice published on Nov. 1. On Oct. 28, a voluntary recall involving Wonder Brands Inc., was issued for bread and bun products sold at Costco and Giant Tiger.  Bread products under the brand names Compliments, Dempster’s, Harvest Gold, Pom and Sunshine involving the firm Bimbo Canada were also recalled on Nov. 5. Country Harvest, Deli World, D’Italiano, Giant Value, Great Value, no name, President’s Choice  The CFIA issued a recall notice on Nov. 6 for Hestars Temple Street Crispy Rice (“Corn flavour”) 108-gram package with UPC code 6 970798 321981 was recalled. It impacts all codes where milk is not declared on the label. The recall was triggered by a consumer complaint. CFIA says there’s been one reported reaction associated with the consumption of this product. The impacted products were distributed in Nova Scotia, Ontario and Quebec. The affected product is being recalled from the marketplace because it contains milk that is not declared on the label. Check to see if you have recalled products, don’t consume recalled products to which you are allergic or sensitive as they may cause a serious or life-threatening reaction. Do not serve, use, sell or distribute recalled products. Recalled products should be thrown out or returned to the location where they were purchased.  Hestars brand Temple Street Crispy Rice (“Corn flavor”) recalled due to undeclared milk.  Health Canada issued a recall notice on Nov. 7 involving the Quad Lock MAG Battery Pack (QMA-BPK-5000), which is a wireless portable power bank, equipped with chargeable lithium-ion batteries. The battery packs are black and measure approximately 83 by 60 by 16 millimetres. The recall notice indicates the battery pack can experience overheating, melting or heat-related deformation posing a fire hazard to consumers. The company reported that 1,582 units of the affected products were sold in Canada and 13,706 were sold in the United States between April 2023 to September 2024. As of Nov. 1, the company has received no reports of overheating in Canada, and no reports of injuries. In the United States, the company has received three reports of overheating and no reports of injuries. This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Quad Lock. Health Canada recommends people “immediately stop using the product” and contact Quad Lock for a refund or store credit. “Dispose of the product by contacting your municipality for instructions on how to safely transport and dispose of lithium-ion batteries,” the health agency says. Contact your municipality for instructions on how to safely transport and dispose of lithium-ion batteries. Batteries are considered hazardous waste. Do not place them in household garbage. For more information, consumers can contact Quad Lock by telephone toll-free at 833-362-9855, from 9 a.m. to 4 p.m. PT Monday through Friday, by email at recall@quadlock.com.au or online. Quad Lock MAG Battery Pack recalled due to fire hazard. Person holding the battery pack. This recall involves Wolf dual fuel range with infrared griddle available in three sizes with various configurations (including with a stainless steel, white or black door). The serial and model numbers are printed on the rating plate underneath the top of the oven. The recalled ranges have serial numbers from 18517201 to 18868311. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. Serial numbers and models impacted. The recall listing explains a spill of liquids (such as a boiling over) can cause a short-circuit in a plug of an electronic component which controls the griddle. “The griddle can turn on unexpectedly, posing a burn or fire hazard to consumers,” the recall notice says.  This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Wolf Appliance, Inc. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. As of Oct. 22, the company has received three reports of griddles turning on in Canada and no reports of injuries. In the U.S., the company has received 33 reports of griddles turning on and no reports of injuries. Consumers should “immediately stop using” the recalled item and contact Wolf Appliance to schedule a free repair in their home. For more information, consumers can contact Wolf Appliance by telephone at 1-800-200-7820 from 8 a.m. to 4:30 p.m. CT Monday through Friday, by email at support@wolfappliance.com or online at www.wolfappliance.com/recall or www.subzero-wolf.com and click on “Important Recall Information” at the bottom of the website for more information. Health Canada has issued a recall notice for two JAMP Pharma pregnancy multivitamins as the impacted lots “exceed the acceptable intake limit for N-nitroso-folic acid.” The recalling company is listed as JAMP Pharma Corporation. The recall notice indicates the supplements were distributed nationally, according to the recall noticed posted on Nov. 6. Health Canada says products were distributed in Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador, Ontario, Quebec and Saskatchewan. JAMP Pharma Pregnancy Multivitamin and JAMP Pharma Pregnancy Multivitamin Folic 5 are impacted  Health Canada has issued a national recall for Dead Down Wind Broad Spectrum SPF 30 Odourless Lip Balm because it was sold without market authorization. The “unauthorized product” was sold through Amazon and Cabela’s. The Health Canada recall notice indicates the product was sold “without market authorization,” namely a drug identification number in Canada. Health Canada says product was sold ‘without market authorization.’ To see all recalls posted visit the Government of Canada’s recall list featuring recalls issued by Health Canada and the Canadian Food Inspection Agency. \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        Still want to see Taylor Swift’s Toronto Eras Tour? Try winning concert tickets with these new contests",
    "img": "https://bloximages.chicago2.vip.townnews.com/yorkregion.com/content/tncms/assets/v3/editorial/c/67/c6702d8b-1d33-5566-8e9e-c6331d85775a/672e747448ab5.image.jpg?resize=200%2C133",
    "url": "https://www.yorkregion.com/news/still-want-to-see-taylor-swifts-toronto-eras-tour-try-winning-concert-tickets-with-these/article_ac3a1035-3c5c-545d-8977-ca03ccf1de90.html",
    "description": "You still have a chance to win some Taylor Swift’s Eras Tour tickets in Toronto. Six sold-out shows are happening at the Rogers Centre from Nov. 14 to 23, and if you didn’t get your hands on tickets, there are still a few ways to win some.  Here’s some of the contests running: — With files from Itai Buenahora \nError! Sorry, there was an error processing your request.\n         \n           There was a problem with the recaptcha. Please try again.\n         \n                                     You may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and  terms of service apply.\n                                 \n                                     Want more of the latest from us? Sign up for more at our newsletter page.\n                                 Contact Metroland Staff at thenewsroom@metroland.com. To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation"
  },
  {
    "body": "\n        \n\n        \n            Ready for some winter fun in Vaughan? WinterFest returns to Canada’s Wonderland",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/1/f2/1f2acfe4-c054-545e-a202-31d7b77face9/672df8171a963.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/ready-for-some-winter-fun-in-vaughan-winterfest-returns-to-canada-s-wonderland/article_5e6a1609-9f58-585c-b411-716eb85a3cfc.html",
    "description": "The holiday magic of WinterFest returns to Canada’s Wonderland for its fifth season on Nov. 16. The annual holiday event — featuring live shows, enchanted themed areas, millions of lights, and festive food — is open on select dates until Jan. 4, 2025. “Get ready for the biggest, brightest holiday experience around,” said Phil Liggett, general manager in a news release. “WinterFest is a feel-good event for guests of all ages and brings the magic of the season to life. If you haven’t had a chance to see it, this is Canada’s Wonderland like you’ve never seen it before.” This year’s festivities include a nightly tree lighting ceremony, nine live shows, musical performances and interactive attractions like ice skating on Snow Flake Lake, photo ops with Elf on a Shelf and cookie decorating with Mrs. Claus.  Wonderland’s WinterFest returns with more than 40 attractions, including:  Tinker’s Toy Factory: An indoor show at Canterbury Theatre with music, acrobatics and an entertaining story about elf hijinks in Santa’s Workshop.  Rides: Guests can enjoy more than 20 rides, including the children’s rides in Charlie Brown’s Christmas Town, and other favourites like Thunder Run, Klockwerks, Psyclone and Sledge Hammer. Ice Skating on Snow Flake Lake: Attendees can glide down the ice on the shimmering, frozen lake in front of Wonder Mountain and surrounded by lit trees and holiday light projections. Advance online reservations are required. Nightly tree-lighting ceremony: A song-and-dance event on International Street where two 50-foot-tall Christmas trees are lit, and decorated with thousands of lights and ornaments.  Cool Yule Christmas: A high-energy, fun-filled show covering Christmas pop songs. Jack Frost’s Igloo Village: Guests can rent a cosy, private igloo for the evening with concierge food and beverage service. Four Drummers Drumming: Playful toy soldiers drum familiar favourites with the crowd. A PEANUTS™ Guide to Christmas: Guests can join Charlie Brown and the gang in an enjoyable singalong to celebrate the holidays. Elf on the Shelf: Santa’s favourite helper will keep an eye on guests and is happy to pose for photos. Christmas Market: A Christmas market featuring local artisan vendors, food and amazing gift ideas.  Find a full list of shows and attractions, operating hours, tickets and reservations for WinterFest 2024 here. Top stories delivered to your inbox. Veracia Ankrah is a reporter with YorkRegion.com. Reach her at vankrah@metroland.com."
  },
  {
    "body": "\n        \n\n        \n            Typical fall weekend will run cool and warm for southern Ontario from Nov. 9-10",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/e/5f/e5f1a5c3-43e1-509c-81f8-31f39517e354/672e962f79b40.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/typical-fall-weekend-will-run-cool-and-warm-for-southern-ontario-from-nov-9-10/article_af224d54-f207-55b6-9275-40dbbe31b47f.html",
    "description": "The “typical ebb and flow of warmth and cooler temperatures through the fall” will lean to the cooler side for most of southern Ontario on Saturday. After a forecasted high in the low teens on Friday, the overnight temperature into Saturday was forecasted to drop to 0 C, with Saturday’s high only 7 C amid clear skies for Pearson airport in Mississauga. That’s actually pretty close to normal for this time of year, with Environment Canada listing the normal high at 8 C and low at 2 C for Pearson. But another system coming in on Sunday will again shoot temperatures back a bit above normal (10 C at Pearson), along with a chance of showers. That system will roll through starting Sunday morning in the southwestern portion of the province, said Environment Canada meteorologist Steven Flisfeder. “The further east you are, it’ll be more into the afternoon, evening,” he said. “But we’re not expecting too much precipitation with it. It’s very dry in the middle atmosphere, so it’s very likely that a lot of that moisture associated with it will even evaporate as it falls, so not expecting too much in terms of actual accumulation.” That warmth will stick around on Monday (11 C at Pearson) before yet another system will come and drop temperatures back down to normal. It’s pretty much the pattern for most of southern Ontario according to Environment Canada forecasts, which you can check here for Hamilton, St. Catharines, Peterborough, Barrie and Ottawa. Southwestern Ontario is forecasted to remain above normal all weekend, according to the Environment Canada forecast for Windsor, London and Sarnia. Top stories delivered to your inbox. Norm Nelson is an online editor with Metroland. Email nnelson@metroland.com to reach him."
  },
  {
    "body": "\n        \n\n        \n            Got mail? Here are other mail and shipping options for Canadians as potential Canada Post strike looms",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/6/b4/6b43edd7-1235-5c76-83b7-abf0647698db/672e803452567.image.jpg?resize=200%2C130",
    "url": "https://www.toronto.com/news/got-mail-here-are-other-mail-and-shipping-options-for-canadians-as-potential-canada-post/article_ee90a47e-1886-5ab8-a2e4-ab44a6df63dc.html",
    "description": "As the threat of a possible work stoppage at Canada Post looms ahead of the holidays, you may be wondering what other shipping services are available to you. There are numerous options actually. Canada Post and the union representing its postal workers are negotiating a new collective agreement. While neither side has issued a notice of strike or lockout, both parties are in a legal position to do so. They must provide a minimum of 72 hours' notice before a labour disruption can occur. Canada Post has said the threat of this labour disruption has already impacted its business, as volumes and revenue are down ahead of what’s usually a busy holiday shipping season. So, if you are feeling nervous about using Canada’s postal service, even as it continues to deliver the mail, below are some options available to you for shipping within Canada and internationally. U.S.-based global shipping company FedEx offers Canada-wide and international shipping services. It consists of express delivery and includes next-day delivery to most metropolitan areas, to standard ground and freight services. If you need to send items to the United States or other international markets, FedEx has standard shipping and express options, including next-day shipping to many locations within the U.S. More information is available at fedex.com. While Canada Post is the majority owner of Purolator, the workers at this Canadian courier company are represented by a different union than those at Canada Post. So any strike action at Canada Post will not impact Purolator’s services. The shipping company can deliver packages to, from and within Canada and to more than 210 countries. With more than 2,500 authorized shipping agents in Canada, finding a location is as easy as finding a local pharmacy. More information is available at purolator.com. Another U.S.-based company, UPS provides global shipping and logistics services. Canadians can use it for domestic and international shipping, including same-day delivery options as well as freight shipping options. The company also offers Saturday delivery in Canada. More information is available at ups.com. What launched as a local delivery business in the Toronto area in the 1980s has grown to become a courier transportation and logistics company serving all of Canada as well as in the U.S., with a focus on serving health-care, IT and retail businesses. More information is available at appleexpress.com. The DHL international courier service provider, which is owned by Germany’s Deutsche Post, provides services for international shipping from Canada. DHL has document and parcel services for all shippers, as well as retailer and volume shipping and cargo shipping for businesses. More information is available at dhl.com. ShippingChimp provides shipping services anywhere in Canada and the U.S., as well as to destinations in other parts of the world, with a focus on eCommerce shipping solutions for small businesses. More information is available at shippingchimp.com. DTDC Express Canada, which is part of India’s largest parcel delivery network, is a courier specializing in cross-border eCommerce services. It has a direct presence in 21 countries, including the U.S. and U.K., and with operations, through associates, in many other countries. More information is available at canada.dtdc.com. Quebec-based last-kilometre logistics company Intelcom, which operates as Dragonfly outside Quebec, utilizes independent delivery partners to handle up to 600,000 daily deliveries in 10 provinces and two territories. The company has numerous stations in Ontario. More information is available at intelcom.ca. Top stories delivered to your inbox. Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        \n            Ontario, Canada recalls: Space heaters sold on Amazon, Wolf griddle, lip balm, Johnsonville sausages, bread sold at Sobeys, FreshCo, Foodland, Metro, Shoppers Drug Mart and more",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/e/36/e36c9a35-33e5-5734-88e3-6e7ac70b1601/672e75d4b5c0d.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/ontario-canada-recalls-space-heaters-sold-on-amazon-wolf-griddle-lip-balm-johnsonville-sausages-bread/article_88378b27-bd3d-5670-8d81-5efe42877e09.html",
    "description": "Thousands of space heaters sold on Amazon, battery packs, various bread and buns sold at major Ontario grocery stores, Wolf griddle, Johnsonville sausages, crispy rice snacks, pregnancy multivitamins and more have recently been recalled by Health Canada and the Canadian Food Inspection Agency (CFIA). The CFIA issued a recall on Nov. 1 for Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages due incorrect best-before date. The sausages were distributed in Alberta, British Columbia, New Brunswick, Ontario and Quebec.  CFIA tells people not to use sell, serve or distribute the affected products. Johnsonville brand Smoked Beef Sausages and Smoked Beef Cheddar Cheese Sausages have been recalled. The CFIA has issued a recall notice on Oct. 30 for an Italian cheese distributed in Ontario and other Canadian provinces. The Dal Molise brand Burratina soft Italian fresh cheese with creamy centre is being recalled due to \"generic E. coli.\" Dal Molise brand Burratina Soft Italian Fresh Cheese with Creamy Center recalled due to \"generic E. coli.\" Dal Molise brand Burratina Soft Italian Fresh Cheese with Creamy Center recalled due to \"generic E. coli.\" Health Canada has issued a recall notice on Nov. 7 for various models of GoveeLife and Govee smart electric space heaters, which were sold through Amazon, due to fire and burn hazards.  The company reported approximately 48,584 units were sold in Canada and approximately 512,500 units were sold in the U.S. from October 2021 through May 2024. As of Oct. 28, the company has received seven reports of overheating in Canada and no report of injuries. In the U.S., the company has received 106 reports of overheating and one report of a “minor burn injury.” There has been one report of a “minor burn injury” in the U.S., and seven reports of overheating in Canada.  There has been one report of a “minor burn injury” in the U.S., and seven reports of overheating in Canada.  The CFIA has issued a recall notice for various popular bread brands including Country Harvest, Deli World, D'Italiano, Giant Value, Great Value, no name, President's Choice and Wonder due to “pieces of metal.” The products were sold through Metro, Shoppers Drug Mart, Amazon, Real Canadian Superstore, No Frills, Zehrs, Foodland, FreshCo, and Sobeys locations, as well as through Voilà fulfilment centres. The products have been distributed in Ontario, Newfoundland and Labrador and Quebec. More than three dozen products have been impacted. A full list can be found by visiting the full CFIA recall notice published on Nov. 1. On Oct. 28, a voluntary recall involving Wonder Brands Inc., was issued for bread and bun products sold at Costco and Giant Tiger.  Bread products under the brand names Compliments, Dempster's, Harvest Gold, Pom and Sunshine involving the firm Bimbo Canada were also recalled on Nov. 5. Country Harvest, Deli World, D'Italiano, Giant Value, Great Value, no name, President's Choice and Wonder products have been recalled. Country Harvest, Deli World, D'Italiano, Giant Value, Great Value, no name, President's Choice and Wonder products have been recalled. The CFIA issued a recall notice on Nov. 6 for Hestars Temple Street Crispy Rice (\"Corn flavour\") 108-gram package with UPC code 6 970798 321981 was recalled. It impacts all codes where milk is not declared on the label. The recall was triggered by a consumer complaint. CFIA says there's been one reported reaction associated with the consumption of this product. The impacted products were distributed in Nova Scotia, Ontario and Quebec. The affected product is being recalled from the marketplace because it contains milk that is not declared on the label. Check to see if you have recalled products, don't consume recalled products to which you are allergic or sensitive as they may cause a serious or life-threatening reaction. Do not serve, use, sell or distribute recalled products. Recalled products should be thrown out or returned to the location where they were purchased.  Hestars brand Temple Street Crispy Rice (\"Corn flavor\") recalled due to undeclared milk.  Health Canada issued a recall notice on Nov. 7 involving the Quad Lock MAG Battery Pack (QMA-BPK-5000), which is a wireless portable power bank, equipped with chargeable lithium-ion batteries. The battery packs are black and measure approximately 83 by 60 by 16 millimetres. The recall notice indicates the battery pack can experience overheating, melting or heat-related deformation posing a fire hazard to consumers. The company reported that 1,582 units of the affected products were sold in Canada and 13,706 were sold in the United States between April 2023 to September 2024. As of Nov. 1, the company has received no reports of overheating in Canada, and no reports of injuries. In the United States, the company has received three reports of overheating and no reports of injuries. This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Quad Lock. Health Canada recommends people \"immediately stop using the product\" and contact Quad Lock for a refund or store credit. \"Dispose of the product by contacting your municipality for instructions on how to safely transport and dispose of lithium-ion batteries,\" the health agency says. Contact your municipality for instructions on how to safely transport and dispose of lithium-ion batteries. Batteries are considered hazardous waste. Do not place them in household garbage. For more information, consumers can contact Quad Lock by telephone toll-free at 833-362-9855, from 9 a.m. to 4 p.m. PT Monday through Friday, by email at recall@quadlock.com.au or online. Quad Lock MAG Battery Pack recalled due to fire hazard. Person holding the battery pack. This recall involves Wolf dual fuel range with infrared griddle available in three sizes with various configurations (including with a stainless steel, white or black door). The serial and model numbers are printed on the rating plate underneath the top of the oven. The recalled ranges have serial numbers from 18517201 to 18868311. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. Serial numbers and models impacted. The recall listing explains a spill of liquids (such as a boiling over) can cause a short-circuit in a plug of an electronic component which controls the griddle. \"The griddle can turn on unexpectedly, posing a burn or fire hazard to consumers,\" the recall notice says.  This is a joint recall with Health Canada, the United States Consumer Product Safety Commission and Wolf Appliance, Inc. Wolf Dual Fuel range with infrared griddle recalled due to burn and fire hazards. As of Oct. 22, the company has received three reports of griddles turning on in Canada and no reports of injuries. In the U.S., the company has received 33 reports of griddles turning on and no reports of injuries. Consumers should \"immediately stop using\" the recalled item and contact Wolf Appliance to schedule a free repair in their home. For more information, consumers can contact Wolf Appliance by telephone at 1-800-200-7820 from 8 a.m. to 4:30 p.m. CT Monday through Friday, by email at support@wolfappliance.com or online at www.wolfappliance.com/recall or www.subzero-wolf.com and click on “Important Recall Information” at the bottom of the website for more information. Health Canada has issued a recall notice for two JAMP Pharma pregnancy multivitamins as the impacted lots \"exceed the acceptable intake limit for N-nitroso-folic acid.\" The recalling company is listed as JAMP Pharma Corporation. The recall notice indicates the supplements were distributed nationally, according to the recall noticed posted on Nov. 6. Health Canada says products were distributed in Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador, Ontario, Quebec and Saskatchewan. JAMP Pharma Pregnancy Multivitamin and JAMP Pharma Pregnancy Multivitamin Folic 5 are impacted by the recall. JAMP Pharma Pregnancy Multivitamin and JAMP Pharma Pregnancy Multivitamin Folic 5 are impacted by the recall. Health Canada has issued a national recall for Dead Down Wind Broad Spectrum SPF 30 Odourless Lip Balm because it was sold without market authorization. The “unauthorized product” was sold through Amazon and Cabela's. The Health Canada recall notice indicates the product was sold “without market authorization,” namely a drug identification number in Canada. Health Canada says product was sold 'without market authorization.' Health Canada says product was sold 'without market authorization.' To see all recalls posted visit the Government of Canada's recall list featuring recalls issued by Health Canada and the Canadian Food Inspection Agency. Top stories delivered to your inbox. Contact Metroland Staff at thenewsroom@metroland.com."
  },
  {
    "body": "\n        \n\n        \n            Still want to see Taylor Swift's Toronto Eras Tour? Try winning concert tickets with these new contests",
    "img": "https://bloximages.newyork1.vip.townnews.com/toronto.com/content/tncms/assets/v3/editorial/7/ac/7acb0c6a-fcc8-5e03-afc4-14374bf268e6/672e747468937.image.jpg?resize=200%2C133",
    "url": "https://www.toronto.com/news/still-want-to-see-taylor-swifts-toronto-eras-tour-try-winning-concert-tickets-with-these/article_30e2b548-9417-51e5-92d2-e1467db79ac7.html",
    "description": "You still have a chance to win some Taylor Swift’s Eras Tour tickets in Toronto. Six sold-out shows are happening at the Rogers Centre from Nov. 14 to 23, and if you didn’t get your hands on tickets, there are still a few ways to win some. Here's some of the contests running: — With files from Itai Buenahora Top stories delivered to your inbox. Contact Metroland Staff at thenewsroom@metroland.com."
  }
]